STMicroelectronics/STM32PRGFW-UTIL/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp257cxx_ca35.h
  __IO uint32_t DMAC0RXIWTR;      /*!< Channel 0 Rx interrupt watchdog timer register             Address offset: 0x1138 */
  __IO uint32_t DMAC0SFCSR;       /*!< Channel 0 slot function control status register            Address offset: 0x113C */
       uint32_t RESERVED49;       /*!< Reserved                                                   Address offset: 0x1140 */
  __IO uint32_t DMAC0CATXDR;      /*!< Channel 0 current application transmit descriptor register Address offset: 0x1144 */
       uint32_t RESERVED50;       /*!< Reserved                                                   Address offset: 0x1148 */
  __IO uint32_t DMAC0CARXDR;      /*!< Channel 0 current application receive descriptor register  Address offset: 0x114C */
       uint32_t RESERVED51;       /*!< Reserved                                                   Address offset: 0x1150 */
  __IO uint32_t DMAC0CATXBR;      /*!< Channel 0 current application transmit buffer register     Address offset: 0x1154 */
       uint32_t RESERVED52;       /*!< Reserved                                                   Address offset: 0x1158 */
  __IO uint32_t DMAC0CARXBR;      /*!< Channel 0 current application receive buffer register      Address offset: 0x115C */
  __IO uint32_t DMAC0SR;          /*!< Channel 0 status register                                  Address offset: 0x1160 */
  __IO uint32_t DMAC0MFCR;        /*!< Channel 0 missed frame count register                      Address offset: 0x1164 */
       uint32_t RESERVED53[6];    /*!< Reserved                                                   Address offset: 0x1168-0x117C */
  __IO uint32_t DMAC1CR;          /*!< Channel 1 control register                                 Address offset: 0x1180 */
  __IO uint32_t DMAC1TXCR;        /*!< Channel 1 transmit control register                        Address offset: 0x1184 */
       uint32_t RESERVED54[3];    /*!< Reserved                                                   Address offset: 0x1188-0x1190 */
  __IO uint32_t DMAC1TXDLAR;      /*!< Channel 1 Tx descriptor list address register              Address offset: 0x1194 */
       uint32_t RESERVED55[2];    /*!< Reserved                                                   Address offset: 0x1198-0x119C */
  __IO uint32_t DMAC1TXDTPR;      /*!< Channel 1 Tx descriptor tail pointer register              Address offset: 0x11A0 */
       uint32_t RESERVED56[2];    /*!< Reserved                                                   Address offset: 0x11A4-0x11A8 */
  __IO uint32_t DMAC1TXRLR;       /*!< Channel 1 Tx descriptor ring length register               Address offset: 0x11AC */
       uint32_t RESERVED57;       /*!< Reserved                                                   Address offset: 0x11B0 */
  __IO uint32_t DMAC1IER;         /*!< Channel 1 interrupt enable register                        Address offset: 0x11B4 */
       uint32_t RESERVED58;       /*!< Reserved                                                   Address offset: 0x11B8 */
  __IO uint32_t DMAC1SFCSR;       /*!< Channel 1 slot function control status register            Address offset: 0x11BC */
       uint32_t RESERVED59;       /*!< Reserved                                                   Address offset: 0x11C0 */
  __IO uint32_t DMAC1CATXDR;      /*!< Channel 1 current application transmit descriptor register Address offset: 0x11C4 */
       uint32_t RESERVED60[3];    /*!< Reserved                                                   Address offset: 0x11C8-0x11D0 */
  __IO uint32_t DMAC1CATXBR;      /*!< Channel 1 current application transmit buffer register     Address offset: 0x11D4 */
       uint32_t RESERVED61[2];    /*!< Reserved                                                   Address offset: 0x11D8-0x11DC */
  __IO uint32_t DMAC1SR;          /*!< Channel 1 status register                                  Address offset: 0x11E0 */
  __IO uint32_t DMAC1MFCR;        /*!< Channel 1 missed frame count register                      Address offset: 0x11E4 */
} ETH_TypeDef;

/**
  * @brief ETHERNET switch accelerator module message buffer (ETHSW_ACMMSG)
  */
typedef struct
{
  __IO uint32_t MSGBUFDESC[64];                     /*!< Message Buffer Descriptor x,         Address offset: 0x00000-0x000FC */
       uint32_t RESERVED0[64];                      /*!< Reserved,                            Address offset: 0x00100-0x001FC */
  __IO uint32_t LOCKCTRLLOW;                        /*!< Message Buffer Locking Control Low,  Address offset:         0x00200 */
  __IO uint32_t LOCKCTRLHIGH;                       /*!< Message Buffer Locking Control High, Address offset:         0x00204 */
       uint32_t RESERVED1[62];                      /*!< Reserved,                            Address offset: 0x00208-0x002FC */
  __IO uint32_t RESETCTRLLOW;                       /*!< Message Buffer Reset Control Low,    Address offset:         0x00300 */
  __IO uint32_t RESETCTRLHIGH;                      /*!< Message Buffer Reset Control High,   Address offset:         0x00304 */
       uint32_t RESERVED2[62];                      /*!< Reserved,                            Address offset: 0x00308-0x003FC */
  __IO uint32_t IRQSTATUSLOW;                       /*!< Message Buffer IRQ Control Low,      Address offset:         0x00400 */
  __IO uint32_t IRQSTATUSHIGH;                      /*!< Message Buffer IRQ Control High,     Address offset:         0x00404 */
       uint32_t RESERVED3[2];                       /*!< Reserved,                            Address offset: 0x00408-0x0040C */
  __IO uint32_t IRQTESTLOW;                         /*!< Message Buffer IRQ Test Low,         Address offset:         0x00410 */
  __IO uint32_t IRQTESTHIGH;                        /*!< Message Buffer IRQ Test High,        Address offset:         0x00414 */
       uint32_t RESERVED4[58];                      /*!< Reserved,                            Address offset: 0x00418-0x004FC */
       uint32_t RESERVED5[64];                      /*!< Reserved,                            Address offset: 0x00500-0x005FC */
  __IO uint32_t MSGBUFSTATUS[64];                   /*!< Message Buffer Status x,             Address offset: 0x00600-0x006FC */
       uint32_t RESERVED6[15936];                   /*!< Reserved,                            Address offset: 0x00700-0x0FFFC */
  __IO uint32_t MSGBUFDATA[64*512];                 /*!< Message Buffer Data x,               Address offset: 0x10000-0x2FFFC */
       uint32_t RESERVED7[16384];                   /*!< Reserved,                            Address offset: 0x30000-0x3FFFC */
} ETHSW_ACMMSG_TypeDef;
