STMicroelectronics/STM32PRGFW-UTIL/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp257cxx_ca35.h
/**
  * @brief Universal Synchronous Asynchronous Receiver Transmitter
  */
/* c7amba_sci3_v3.0 */
typedef struct
{
  __IO uint32_t CR1;             /*!< USART Control register 1                    Address offset: 0x000 */
  __IO uint32_t CR2;             /*!< USART Control register 2                    Address offset: 0x004 */
  __IO uint32_t CR3;             /*!< USART Control register 3                    Address offset: 0x008 */
  __IO uint32_t BRR;             /*!< USART Baud rate register                    Address offset: 0x00C */
  __IO uint32_t GTPR;            /*!< USART Guard time and prescaler register     Address offset: 0x010 */
  __IO uint32_t RTOR;            /*!< USART Receiver timeout register             Address offset: 0x014 */
  __IO uint32_t RQR;             /*!< USART Request register                      Address offset: 0x018 */
  __IO uint32_t ISR;             /*!< USART Interrupt and status register         Address offset: 0x01C */
  __IO uint32_t ICR;             /*!< USART Interrupt flag Clear register         Address offset: 0x020 */
  __IO uint32_t RDR;             /*!< USART Receive Data register                 Address offset: 0x024 */
  __IO uint32_t TDR;             /*!< USART Transmit Data register                Address offset: 0x028 */
  __IO uint32_t PRESC;           /*!< USART Prescaler register                    Address offset: 0x02C */
  __IO uint32_t AUTOCR;          /*!< USART Autonomous mode Control register      Address offset: 0x030 */
       uint32_t RESERVED0[238];  /*!< Reserved                                    Address offset: 0x034-0x3E8 */
  __IO uint32_t HWCFGR2;         /*!< USART Hardware Configuration register 2     Address offset: 0x3EC */
  __IO uint32_t HWCFGR1;         /*!< USART Hardware Configuration register 1     Address offset: 0x3F0 */
  __IO uint32_t VERR;            /*!< USART version register                      Address offset: 0x3F4 */
  __IO uint32_t IPIDR;           /*!< USART Identification register               Address offset: 0x3F8 */
  __IO uint32_t SIDR;            /*!< USART Size Identification register          Address offset: 0x3FC */
} USART_TypeDef;

/*
 * @brief USB3 Global Register Block
 */

typedef struct
{
  __IO uint32_t GSBUSCFG0;         /*!< (null) @ offset 0x0 */
  __IO uint32_t GSBUSCFG1;         /*!< (null) @ offset 0x4 */
  __IO uint32_t GTXTHRCFG;         /*!< (null) @ offset 0x8 */
  __IO uint32_t GRXTHRCFG;         /*!< (null) @ offset 0xc */
  __IO uint32_t GCTL;              /*!< (null) @ offset 0x10 */
  __IO uint32_t GPMSTS;            /*!< (null) @ offset 0x14 */
  __IO uint32_t GSTS;              /*!< (null) @ offset 0x18 */
  __IO uint32_t GUCTL1;            /*!< (null) @ offset 0x1c */
  __IO uint32_t GSNPSID;           /*!< (null) @ offset 0x20 */
  __IO uint32_t GGPIO;             /*!< (null) @ offset 0x24 */
  __IO uint32_t GUID;              /*!< (null) @ offset 0x28 */
  __IO uint32_t GUCTL;             /*!< (null) @ offset 0x2c */
  __IO uint32_t GBUSERRADDRLO;     /*!< (null) @ offset 0x30 */
  __IO uint32_t GBUSERRADDRHI;     /*!< (null) @ offset 0x34 */
  __IO uint32_t GPRTBIMAPLO;       /*!< (null) @ offset 0x38 */
  __IO uint32_t GPRTBIMAPHI;       /*!< (null) @ offset 0x3c */
  __IO uint32_t GHWPARAMS0;        /*!< (null) @ offset 0x40 */
  __IO uint32_t GHWPARAMS1;        /*!< (null) @ offset 0x44 */
  __IO uint32_t GHWPARAMS2;        /*!< (null) @ offset 0x48 */
  __IO uint32_t GHWPARAMS3;        /*!< (null) @ offset 0x4c */
  __IO uint32_t GHWPARAMS4;        /*!< (null) @ offset 0x50 */
  __IO uint32_t GHWPARAMS5;        /*!< (null) @ offset 0x54 */
  __IO uint32_t GHWPARAMS6;        /*!< (null) @ offset 0x58 */
  __IO uint32_t GHWPARAMS7;        /*!< (null) @ offset 0x5c */
  __IO uint32_t GDBGFIFOSPACE;     /*!< (null) @ offset 0x60 */
  __IO uint32_t GDBGLTSSM;         /*!< (null) @ offset 0x64 */
  __IO uint32_t GDBGLNMCC;         /*!< (null) @ offset 0x68 */
  __IO uint32_t GDBGBMU;           /*!< (null) @ offset 0x6c */
  __IO uint32_t GDBGLSPMUX_HST;    /*!< (null) @ offset 0x70 */
  __IO uint32_t GDBGLSP;           /*!< (null) @ offset 0x74 */
  __IO uint32_t GDBGEPINFO0;       /*!< (null) @ offset 0x78 */
  __IO uint32_t GDBGEPINFO1;       /*!< (null) @ offset 0x7c */
  __IO uint32_t GPRTBIMAP_HSLO;    /*!< (null) @ offset 0x80 */
  __IO uint32_t GPRTBIMAP_HSHI;    /*!< (null) @ offset 0x84 */
  __IO uint32_t GPRTBIMAP_FSLO;    /*!< (null) @ offset 0x88 */
  __IO uint32_t GPRTBIMAP_FSHI;    /*!< (null) @ offset 0x8c */
       uint32_t RESERVED0;         /*!< Reserved @ offset 0x90 */
       uint32_t Reserved_94;       /*!< (null) @ offset 0x94 */
       uint32_t Reserved_98;       /*!< (null) @ offset 0x98 */
  __IO uint32_t GUCTL2;            /*!< (null) @ offset 0x9c */
       uint32_t RESERVED1[24];     /*!< Reserved @ offset 0xa0 */
  __IO uint32_t GUSB2PHYCFG;       /*!< (null) @ offset 0x100 */
       uint32_t RESERVED2[15];     /*!< Reserved @ offset 0x104 */
  __IO uint32_t GUSB2I2CCTL;       /*!< (null) @ offset 0x140 */
       uint32_t RESERVED3[15];     /*!< Reserved @ offset 0x144 */
  __IO uint32_t GUSB2PHYACC_ULPI;  /*!< (null) @ offset 0x180 */
       uint32_t RESERVED4[15];     /*!< Reserved @ offset 0x184 */
  __IO uint32_t GUSB3PIPECTL;      /*!< (null) @ offset 0x1c0 */
       uint32_t RESERVED5[15];     /*!< Reserved @ offset 0x1c4 */
  __IO uint32_t GTXFIFOSIZ0;       /*!< (null) @ offset 0x200 */
  __IO uint32_t GTXFIFOSIZ1;       /*!< (null) @ offset 0x204 */
  __IO uint32_t GTXFIFOSIZ2;       /*!< (null) @ offset 0x208 */
  __IO uint32_t GTXFIFOSIZ3;       /*!< (null) @ offset 0x20c */
  __IO uint32_t GTXFIFOSIZ4;       /*!< (null) @ offset 0x210 */
  __IO uint32_t GTXFIFOSIZ5;       /*!< (null) @ offset 0x214 */
  __IO uint32_t GTXFIFOSIZ6;       /*!< (null) @ offset 0x218 */
  __IO uint32_t GTXFIFOSIZ7;       /*!< (null) @ offset 0x21c */
  __IO uint32_t GTXFIFOSIZ8;       /*!< (null) @ offset 0x220 */
  __IO uint32_t GTXFIFOSIZ9;       /*!< (null) @ offset 0x224 */
  __IO uint32_t GTXFIFOSIZ10;      /*!< (null) @ offset 0x228 */
  __IO uint32_t GTXFIFOSIZ11;      /*!< (null) @ offset 0x22c */
       uint32_t RESERVED6[20];     /*!< Reserved @ offset 0x230 */
  __IO uint32_t GRXFIFOSIZ0;       /*!< (null) @ offset 0x280 */
  __IO uint32_t GRXFIFOSIZ1;       /*!< (null) @ offset 0x284 */
  __IO uint32_t GRXFIFOSIZ2;       /*!< (null) @ offset 0x288 */
       uint32_t RESERVED7[29];     /*!< Reserved @ offset 0x28c */
  __IO uint32_t GEVNTADRLO;        /*!< (null) @ offset 0x300 */
  __IO uint32_t GEVNTADRHI;        /*!< (null) @ offset 0x304 */
  __IO uint32_t GEVNTSIZ;          /*!< (null) @ offset 0x308 */
  __IO uint32_t GEVNTCOUNT;        /*!< (null) @ offset 0x30c */
       uint32_t RESERVED8[124];    /*!< Reserved @ offset 0x310 */
  __IO uint32_t GHWPARAMS8;        /*!< (null) @ offset 0x500 */
       uint32_t RESERVED9[3];      /*!< Reserved @ offset 0x504 */
  __IO uint32_t GTXFIFOPRIDEV;     /*!< (null) @ offset 0x510 */
       uint32_t RESERVED10;        /*!< Reserved @ offset 0x514 */
  __IO uint32_t GTXFIFOPRIHST;     /*!< (null) @ offset 0x518 */
  __IO uint32_t GRXFIFOPRIHST;     /*!< (null) @ offset 0x51c */
       uint32_t RESERVED11;        /*!< Reserved @ offset 0x520 */
  __IO uint32_t GDMAHLRATIO;       /*!< (null) @ offset 0x524 */
       uint32_t RESERVED12[2];     /*!< Reserved @ offset 0x528 */
  __IO uint32_t GFLADJ;            /*!< (null) @ offset 0x530 */
       uint32_t RESERVED[0xCC/4];  /*!< Reserved @ offset 0x534 */
} USB3_GBL_TypeDef;

