STMicroelectronics/STM32PRGFW-UTIL/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp257cxx_ca35.h
/*
 * @brief USB3 Device Register Block
 */

typedef struct
{
  __IO uint32_t DCFG;             /*!< (null) @ offset 0x0 */
  __IO uint32_t DCTL;             /*!< (null) @ offset 0x4 */
  __IO uint32_t DEVTEN;           /*!< (null) @ offset 0x8 */
  __IO uint32_t DSTS;             /*!< (null) @ offset 0xc */
  __IO uint32_t DGCMDPAR;         /*!< (null) @ offset 0x10 */
  __IO uint32_t DGCMD;            /*!< (null) @ offset 0x14 */
       uint32_t RESERVED13[2];    /*!< Reserved @ offset 0x18 */
  __IO uint32_t DALEPENA;         /*!< (null) @ offset 0x20 */
  __IO uint32_t Rsvd;             /*!< (null) @ offset 0x24 */
       uint32_t RESERVED14[54];   /*!< Reserved @ offset 0x28 */
  __IO uint32_t DEPCMDPAR2;       /*!< (null) @ offset 0x100 */
  __IO uint32_t DEPCMDPAR1;       /*!< (null) @ offset 0x104 */
  __IO uint32_t DEPCMDPAR0;       /*!< (null) @ offset 0x108 */
  __IO uint32_t DEPCMD;           /*!< (null) @ offset 0x10c */
       uint32_t RESERVED15[124];  /*!< Reserved @ offset 0x110 */
  __IO uint32_t DEV_IMOD;         /*!< (null) @ offset 0x300 */
       uint32_t RESERVED[0xFC/4]; /*!< Reserved @ offset 0x304 */
} USB3_DEV_TypeDef;

/*
 * @brief USB3 BC Register Block
 */

typedef struct
{
  __IO uint32_t BCFG;        /*!< (null) @ offset 0x0 */
       uint32_t RESERVED16;  /*!< Reserved @ offset 0x4 */
  __IO uint32_t BCEVT;       /*!< (null) @ offset 0x8 */
  __IO uint32_t BCEVTEN;     /*!< (null) @ offset 0xc */
} USB3_BC_TypeDef;

/*
 * @brief USB3 eXtensible Host Controller Capability Register Block
 */

typedef struct
{
  __IO uint32_t CAPLENGTH;   /*!< (null) @ offset 0x0 */
  __IO uint32_t HCSPARAMS1;  /*!< (null) @ offset 0x4 */
  __IO uint32_t HCSPARAMS2;  /*!< (null) @ offset 0x8 */
  __IO uint32_t HCSPARAMS3;  /*!< (null) @ offset 0xc */
  __IO uint32_t HCCPARAMS1;  /*!< (null) @ offset 0x10 */
  __IO uint32_t DBOFF;       /*!< (null) @ offset 0x14 */
  __IO uint32_t RTSOFF;      /*!< (null) @ offset 0x18 */
  __IO uint32_t HCCPARAMS2;  /*!< (null) @ offset 0x1c */
} USB3_XHCC_TypeDef;

/*
 * @brief USB3 Host Cntrl Oper Regs Block
 */

typedef struct
{
  __IO uint32_t USBCMD;         /*!< (null) @ offset 0x0 */
  __IO uint32_t USBSTS;         /*!< (null) @ offset 0x4 */
  __IO uint32_t PAGESIZE;       /*!< (null) @ offset 0x8 */
       uint32_t RESERVED17[2];  /*!< Reserved @ offset 0xc */
  __IO uint32_t DNCTRL;         /*!< (null) @ offset 0x14 */
  __IO uint32_t CRCR_LO;        /*!< (null) @ offset 0x18 */
  __IO uint32_t CRCR_HI;        /*!< (null) @ offset 0x1c */
       uint32_t RESERVED18[4];  /*!< Reserved @ offset 0x20 */
  __IO uint32_t DCBAAP_LO;      /*!< (null) @ offset 0x30 */
  __IO uint32_t DCBAAP_HI;      /*!< (null) @ offset 0x34 */
  __IO uint32_t CONFIG;         /*!< (null) @ offset 0x38 */
       uint32_t RESERVED[0x3c4/4];    /*!< Reserved @ offset 0x3c */
} USB3_HCO_TypeDef;

/*
 * @brief USB3 Host Cntrl Port Reg Set Block
 */

typedef struct
{
  __IO uint32_t PORTSC_20;     /*!< (null) @ offset 0x0 */
  __IO uint32_t PORTPMSC_20;   /*!< (null) @ offset 0x4 */
  __IO uint32_t PORTLI_20;     /*!< (null) @ offset 0x8 */
  __IO uint32_t PORTHLPMC_20;  /*!< (null) @ offset 0xc */
  __IO uint32_t PORTSC_30;     /*!< (null) @ offset 0x10 */
  __IO uint32_t PORTPMSC_30;   /*!< (null) @ offset 0x14 */
  __IO uint32_t PORTLI_30;     /*!< (null) @ offset 0x18 */
  __IO uint32_t PORTHLPMC_30;  /*!< (null) @ offset 0x1c */
} USB3_HCP_TypeDef;

/*
 * @brief USB3 Host Cntrl Runtime Regs Block
 */

typedef struct
{
  __IO uint32_t MFINDEX;  /*!< (null) @ offset 0x0 */
  __IO uint32_t RsvdZ;    /*!< (null) @ offset 0x4 */
       uint32_t RESERVED[0x14/4];    /*!< Reserved @ offset 0x8 */
} USB3_HCR_TypeDef;

/*
 * @brief USB3 Interrupter Regs Block
 */

typedef struct
{
  __IO uint32_t IMAN;       /*!< (null) @ offset 0x0 */
  __IO uint32_t IMOD;       /*!< (null) @ offset 0x4 */
  __IO uint32_t ERSTSZ;     /*!< (null) @ offset 0x8 */
  __IO uint32_t RsvdP;      /*!< (null) @ offset 0xc */
  __IO uint32_t ERSTBA_LO;  /*!< (null) @ offset 0x10 */
  __IO uint32_t ERSTBA_HI;  /*!< (null) @ offset 0x14 */
  __IO uint32_t ERDP_LO;    /*!< (null) @ offset 0x18 */
  __IO uint32_t ERDP_HI;    /*!< (null) @ offset 0x1c */
} USB3_IT_TypeDef;

/*
 * @brief USB3 Doorbell Reg Block
 */

typedef struct
{
  __IO uint32_t DB;  /*!< (null) @ offset 0x0 */
       uint32_t RESERVED[0x100/4];    /*!< Reserved @ offset 0x4 */
} USB3_DB_TypeDef;

/*
 * @brief USB3 HC Extended Capability Register Block
 */

typedef struct
{
  __IO uint32_t USBLEGSUP;     /*!< (null) @ offset 0x0 */
  __IO uint32_t USBLEGCTLSTS;  /*!< (null) @ offset 0x4 */
       uint32_t RESERVED[0x8/4];    /*!< Reserved @ offset 0x8 */
} USB3_HCEC_TypeDef;

/*
 * @brief USB3 xHCI Supported Protocol Capability (USB 2.0) Block
 */

typedef struct
{
  __IO uint32_t SUPTPRT2_DW0;  /*!< (null) @ offset 0x0 */
  __IO uint32_t SUPTPRT2_DW1;  /*!< (null) @ offset 0x4 */
  __IO uint32_t SUPTPRT2_DW2;  /*!< (null) @ offset 0x8 */
  __IO uint32_t SUPTPRT2_DW3;  /*!< (null) @ offset 0xc */
} USB3_HCISPC2_TypeDef;

/*
 * @brief USB3 xHCI Supported Protocol Capability (USB 3.0) Block
 */

typedef struct
{
  __IO uint32_t SUPTPRT3_DW0;  /*!< (null) @ offset 0x0 */
  __IO uint32_t SUPTPRT3_DW1;  /*!< (null) @ offset 0x4 */
  __IO uint32_t SUPTPRT3_DW2;  /*!< (null) @ offset 0x8 */
  __IO uint32_t SUPTPRT3_DW3;  /*!< (null) @ offset 0xc */
} USB3_HCISPC3_TypeDef;

/*
 * @brief USB3 Register Block
 */

typedef struct
{
  USB3_XHCC_TypeDef XHCCREGS;       /*!< Global Register Block @ offset 0x0 */
  USB3_HCO_TypeDef HCOREGS;         /*!< Global Register Block @ offset 0x20 */
  USB3_HCP_TypeDef HCPREGS;         /*!< Global Register Block @ offset 0x420 */
  USB3_HCR_TypeDef HCRREGS;         /*!< Global Register Block @ offset 0x440 */
  uint32_t RESERVED0;               /*!< Reserved              @ offset 0x45c */
  USB3_IT_TypeDef  ITREGS;          /*!< Global Register Block @ offset 0x460 */
  USB3_DB_TypeDef  DBREGS;          /*!< Global Register Block @ offset 0x480 */
  uint32_t RESERVED1[0x2FC/4];      /*!< Reserved              @ offset 0x584 */
  USB3_HCEC_TypeDef HCECREGS;       /*!< Global Register Block @ offset 0x880 */
  USB3_HCISPC2_TypeDef HCISPC2REGS; /*!< Global Register Block @ offset 0x890 */
  USB3_HCISPC3_TypeDef HCISPC3REGS; /*!< Global Register Block @ offset 0x8a0 */
  uint32_t RESERVED2[0xB850/4];     /*!< Reserved              @ offset 0x8b0 */
  USB3_GBL_TypeDef GBLREGS;         /*!< Global Register Block @ offset 0xc100 */
  USB3_DEV_TypeDef DEVREGS;         /*!< Global Register Block @ offset 0xc700 */
  uint32_t RESERVED3[0x230/4];      /*!< Reserved              @ offset 0xca00 */
  USB3_BC_TypeDef BCREGS;           /*!< Global Register Block @ offset 0xcc30 */
} USB3_TypeDef;

/**
  * @brief VREFBUF
  */
typedef struct
{
  __IO uint32_t CSR;         /*!< VREFBUF control and status register,         Address offset: 0x00 */
  __IO uint32_t CCR;         /*!< VREFBUF calibration and control register,    Address offset: 0x04 */
} VREFBUF_TypeDef;

