STMicroelectronics/STM32PRGFW-UTIL/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp257cxx_ca35.h
/*********  Bit definition for CA35SSC_LPI_STGEN_NTS_CR_WT1 register  *********/
#define CA35SSC_LPI_STGEN_NTS_CR_WT1_STGEN_CSYSREQ_Pos           (24U)
#define CA35SSC_LPI_STGEN_NTS_CR_WT1_STGEN_CSYSREQ_Msk           (0x1U << CA35SSC_LPI_STGEN_NTS_CR_WT1_STGEN_CSYSREQ_Pos) /*!< 0x01000000 */
#define CA35SSC_LPI_STGEN_NTS_CR_WT1_STGEN_CSYSREQ               CA35SSC_LPI_STGEN_NTS_CR_WT1_STGEN_CSYSREQ_Msk           /*!<  */
#define CA35SSC_LPI_STGEN_NTS_CR_WT1_STGEN_CSYSACK_Pos           (25U)
#define CA35SSC_LPI_STGEN_NTS_CR_WT1_STGEN_CSYSACK_Msk           (0x1U << CA35SSC_LPI_STGEN_NTS_CR_WT1_STGEN_CSYSACK_Pos) /*!< 0x02000000 */
#define CA35SSC_LPI_STGEN_NTS_CR_WT1_STGEN_CSYSACK               CA35SSC_LPI_STGEN_NTS_CR_WT1_STGEN_CSYSACK_Msk           /*!<  */

/*****************  Bit definition for CA35SS_VERR register  ******************/
#define CA35SSC_VERR_MINREV_Pos                                  (0U)
#define CA35SSC_VERR_MINREV_Msk                                  (0xFU << CA35SSC_VERR_MINREV_Pos)                     /*!< 0x0000000F */
#define CA35SSC_VERR_MINREV                                      CA35SSC_VERR_MINREV_Msk                               /*!< Minor revision number */
#define CA35SSC_VERR_MAJREV_Pos                                  (4U)
#define CA35SSC_VERR_MAJREV_Msk                                  (0xFU << CA35SSC_VERR_MAJREV_Pos)                     /*!< 0x000000F0 */
#define CA35SSC_VERR_MAJREV                                      CA35SSC_VERR_MAJREV_Msk                               /*!< Major revision number */

/*****************  Bit definition for CA35SS_IPIDR register  *****************/
#define CA35SSC_IPIDR_ID_Pos                                     (0U)
#define CA35SSC_IPIDR_ID_Msk                                     (0xFFFFFFFFU << CA35SSC_IPIDR_ID_Pos)                 /*!< 0xFFFFFFFF */
#define CA35SSC_IPIDR_ID                                         CA35SSC_IPIDR_ID_Msk                                  /*!< Peripheral identification */

/*****************  Bit definition for CA35SS_SIDR register  ******************/
#define CA35SSC_SIDR_SID_Pos                                     (0U)
#define CA35SSC_SIDR_SID_Msk                                     (0xFFFFFFFFU << CA35SSC_SIDR_SID_Pos)                 /*!< 0xFFFFFFFF */
#define CA35SSC_SIDR_SID                                         CA35SSC_SIDR_SID_Msk                                  /*!< block of registers size in Kbytes */

/***********  Bit definition for CA35SSC_NS_ENABLE_0_RW register  ***********/
#define CA35SSC_NS_ENABLE_0_RW_ALLOW_NONSEC_Pos                  (0U)
#define CA35SSC_NS_ENABLE_0_RW_ALLOW_NONSEC_Msk                  (0xFFFFFFFFU << CA35SSC_NS_ENABLE_0_RW_ALLOW_NONSEC_Pos) /*!< 0xFFFFFFFF */
#define CA35SSC_NS_ENABLE_0_RW_ALLOW_NONSEC                      CA35SSC_NS_ENABLE_0_RW_ALLOW_NONSEC_Msk               /*!< Bit n configures the security settings of the SSC register at address 16 * n up to 0x1F0 */

/***********  Bit definition for CA35SSC_NS_ENABLE_0_WS1 register  ***********/
#define CA35SSC_NS_ENABLE_0_WS1_ALLOW_NONSEC_Pos                 (0U)
#define CA35SSC_NS_ENABLE_0_WS1_ALLOW_NONSEC_Msk                 (0xFFFFFFFFU << CA35SSC_NS_ENABLE_0_WS1_ALLOW_NONSEC_Pos) /*!< 0xFFFFFFFF */
#define CA35SSC_NS_ENABLE_0_WS1_ALLOW_NONSEC                     CA35SSC_NS_ENABLE_0_WS1_ALLOW_NONSEC_Msk                /*!< Bit n configures the security settings of the SSC register at address 16 * n up to 0x1F0 */

/***********  Bit definition for CA35SSC_NS_ENABLE_0_WC1 register  ***********/
#define CA35SSC_NS_ENABLE_0_WC1_ALLOW_NONSEC_Pos                 (0U)
#define CA35SSC_NS_ENABLE_0_WC1_ALLOW_NONSEC_Msk                 (0xFFFFFFFFU << CA35SSC_NS_ENABLE_0_WC1_ALLOW_NONSEC_Pos) /*!< 0xFFFFFFFF */
#define CA35SSC_NS_ENABLE_0_WC1_ALLOW_NONSEC                     CA35SSC_NS_ENABLE_0_WC1_ALLOW_NONSEC_Msk                /*!< Bit n configures the security settings of the SSC register at address 16 * n up to 0x1F0 */

/***********  Bit definition for CA35SSC_NS_ENABLE_0_WT1 register  ***********/
#define CA35SSC_NS_ENABLE_0_WT1_ALLOW_NONSEC_Pos                 (0U)
#define CA35SSC_NS_ENABLE_0_WT1_ALLOW_NONSEC_Msk                 (0xFFFFFFFFU << CA35SSC_NS_ENABLE_0_WT1_ALLOW_NONSEC_Pos) /*!< 0xFFFFFFFF */
#define CA35SSC_NS_ENABLE_0_WT1_ALLOW_NONSEC                     CA35SSC_NS_ENABLE_0_WT1_ALLOW_NONSEC_Msk                /*!< Bit n configures the security settings of the SSC register at address 16 * n up to 0x1F0 */

/************  Bit definition for CA35SSC_NS_ENABLE_1 register  ************/
#define CA35SSC_NS_ENABLE_1_ALLOW_NONSEC_RO_Pos                  (28U)
#define CA35SSC_NS_ENABLE_1_ALLOW_NONSEC_RO_Msk                  (0xFU << CA35SSC_NS_ENABLE_1_ALLOW_NONSEC_RO_Pos)     /*!< 0xF0000000 */
#define CA35SSC_NS_ENABLE_1_ALLOW_NONSEC_RO                      CA35SSC_NS_ENABLE_1_ALLOW_NONSEC_RO_Msk               /*!< Bit n indicates the security settings of the SSC register from 0x3C0 (bit 28) up to 0x3F0 (bit 31) */

/******************************************************************************/
/*                                                                            */
/*                                (CA35 SYSCFG)                               */
/*                                                                            */
/******************************************************************************/
/***********  Bit definition for CA35SYSCFG_ETR_LPI_CR register  ***********/
#define CA35SYSCFG_ETR_LPI_CR_ETR_CSYSREQ_Pos                    (0U)
#define CA35SYSCFG_ETR_LPI_CR_ETR_CSYSREQ_Msk                    (0x1U << CA35SYSCFG_ETR_LPI_CR_ETR_CSYSREQ_Pos)       /*!< 0x00000001 */
#define CA35SYSCFG_ETR_LPI_CR_ETR_CSYSREQ                        CA35SYSCFG_ETR_LPI_CR_ETR_CSYSREQ_Msk                 /*!<  */

/***********  Bit definition for CA35SYSCFG_ETR_LPI_SR register  ***********/
#define CA35SYSCFG_ETR_LPI_SR_ETR_CSYSACK_Pos                    (0U)
#define CA35SYSCFG_ETR_LPI_SR_ETR_CSYSACK_Msk                    (0x1U << CA35SYSCFG_ETR_LPI_SR_ETR_CSYSACK_Pos)       /*!< 0x00000001 */
#define CA35SYSCFG_ETR_LPI_SR_ETR_CSYSACK                        CA35SYSCFG_ETR_LPI_SR_ETR_CSYSACK_Msk                 /*!<  */

/********  Bit definition for CA35SYSCFG_STM_NSGUAREN_CR register  *********/
#define CA35SYSCFG_STM_NSGUAREN_CR_STM_NSGUAREN_Pos              (0U)
#define CA35SYSCFG_STM_NSGUAREN_CR_STM_NSGUAREN_Msk              (0x1U << CA35SYSCFG_STM_NSGUAREN_CR_STM_NSGUAREN_Pos) /*!< 0x00000001 */
#define CA35SYSCFG_STM_NSGUAREN_CR_STM_NSGUAREN                  CA35SYSCFG_STM_NSGUAREN_CR_STM_NSGUAREN_Msk           /*!<  */

