STMicroelectronics/STM32PRGFW-UTIL/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp257cxx_ca35.h
/*****************  Bit definition for DCMIPP_IPIDR register  *****************/
#define DCMIPP_IPIDR_IDR_Pos                (0U)
#define DCMIPP_IPIDR_IDR_Msk                (0xFFFFFFFFU << DCMIPP_IPIDR_IDR_Pos)           /*!< 0xFFFFFFFF */
#define DCMIPP_IPIDR_IDR                    DCMIPP_IPIDR_IDR_Msk                            /*!< Paralle camera interface (DCMI) and optional pixel processing (PP) */

/*****************  Bit definition for DCMIPP_SIDR register  ******************/
#define DCMIPP_SIDR_SID_Pos                 (0U)
#define DCMIPP_SIDR_SID_Msk                 (0xFFFFFFFFU << DCMIPP_SIDR_SID_Pos)            /*!< 0xFFFFFFFF */
#define DCMIPP_SIDR_SID                     DCMIPP_SIDR_SID_Msk                             /*!< 4-Kbyte decoding space */

#endif
/******************************************************************************/
/*                                                                            */
/*                             DDR Controller                                 */
/*                                                                            */
/******************************************************************************/
/*****************  Bit definition for DDRC_MSTR register  *****************/
#define DDRC_MSTR_DDR3_Pos              (0U)
#define DDRC_MSTR_DDR3_Msk              (0x1U << DDRC_MSTR_DDR3_Pos)              /*!< 0x00000001 */
#define DDRC_MSTR_DDR3                  DDRC_MSTR_DDR3_Msk                        /*!< Selects DDR3 SDRAM */
#define DDRC_MSTR_DDR4_Pos              (4U)
#define DDRC_MSTR_DDR4_Msk              (0x1U << DDRC_MSTR_DDR4_Pos)              /*!< 0x00000010 */
#define DDRC_MSTR_DDR4                  DDRC_MSTR_DDR4_Msk                        /*!< Selects DDR4 SDRAM */
#define DDRC_MSTR_LPDDR4_Pos            (5U)
#define DDRC_MSTR_LPDDR4_Msk            (0x1U << DDRC_MSTR_LPDDR4_Pos)            /*!< 0x00000020 */
#define DDRC_MSTR_LPDDR4                DDRC_MSTR_LPDDR4_Msk                      /*!< Selects LPDDR4 SDRAM */
#define DDRC_MSTR_DATA_BUS_WIDTH_Pos    (12U)
#define DDRC_MSTR_DATA_BUS_WIDTH_Msk    (0x3U << DDRC_MSTR_DATA_BUS_WIDTH_Pos)    /*!< 0x00003000 */
#define DDRC_MSTR_DATA_BUS_WIDTH        DDRC_MSTR_DATA_BUS_WIDTH_Msk              /*!< Selects proportion of DQ bus width that is used by the SDRAM */
#define DDRC_MSTR_DATA_BUS_WIDTH_0      (0x1U << DDRC_MSTR_DATA_BUS_WIDTH_Pos)    /*!< 0x00001000 */
#define DDRC_MSTR_DATA_BUS_WIDTH_1      (0x2U << DDRC_MSTR_DATA_BUS_WIDTH_Pos)    /*!< 0x00002000 */
#define DDRC_MSTR_DLL_OFF_MODE_Pos      (15U)
#define DDRC_MSTR_DLL_OFF_MODE_Msk      (0x1U << DDRC_MSTR_DLL_OFF_MODE_Pos)      /*!< 0x00008000 */
#define DDRC_MSTR_DLL_OFF_MODE          DDRC_MSTR_DLL_OFF_MODE_Msk                /*!< Set to 1 when the DDRC and DRAM has to be put in DLL-off mode for low frequency operation. */

/*****************  Bit definition for DDRC_STAT register  *****************/
#define DDRC_STAT_OPERATING_MODE_Pos        (0U)
#define DDRC_STAT_OPERATING_MODE_Msk        (0x7U << DDRC_STAT_OPERATING_MODE_Pos)        /*!< 0x00000007 */
#define DDRC_STAT_OPERATING_MODE            DDRC_STAT_OPERATING_MODE_Msk                  /*!< Operating mode. This is 3-bits wide in configurations with mDDR/LPDDR2/LPDDR3/LPDDR4/DDR4 support and 2-bits in all other configurations. */
#define DDRC_STAT_OPERATING_MODE_0          (0x1U << DDRC_STAT_OPERATING_MODE_Pos)        /*!< 0x00000001 */
#define DDRC_STAT_OPERATING_MODE_1          (0x2U << DDRC_STAT_OPERATING_MODE_Pos)        /*!< 0x00000002 */
#define DDRC_STAT_OPERATING_MODE_2          (0x4U << DDRC_STAT_OPERATING_MODE_Pos)        /*!< 0x00000004 */
#define DDRC_STAT_SELFREF_TYPE_Pos          (4U)
#define DDRC_STAT_SELFREF_TYPE_Msk          (0x3U << DDRC_STAT_SELFREF_TYPE_Pos)          /*!< 0x00000030 */
#define DDRC_STAT_SELFREF_TYPE              DDRC_STAT_SELFREF_TYPE_Msk                    /*!< Flags if Self Refresh (except LPDDR4) or SR-Powerdown (LPDDR4) is entered and if it was under Automatic Self Refresh control only or not. */
#define DDRC_STAT_SELFREF_TYPE_0            (0x1U << DDRC_STAT_SELFREF_TYPE_Pos)          /*!< 0x00000010 */
#define DDRC_STAT_SELFREF_TYPE_1            (0x2U << DDRC_STAT_SELFREF_TYPE_Pos)          /*!< 0x00000020 */
#define DDRC_STAT_SELFREF_STATE_Pos         (8U)
#define DDRC_STAT_SELFREF_STATE_Msk         (0x3U << DDRC_STAT_SELFREF_STATE_Pos)         /*!< 0x00000300 */
#define DDRC_STAT_SELFREF_STATE              DDRC_STAT_SELFREF_STATE_Msk                  /*!< SR or SRPD (SR power-down) for LPDDR4. This bitfield is used for frequency change and MRR/MRW access during SR. */
#define DDRC_STAT_SELFREF_STATE_0           (0x1U << DDRC_STAT_SELFREF_STATE_Pos)         /*!< 0x00000100 */
#define DDRC_STAT_SELFREF_STATE_1           (0x2U << DDRC_STAT_SELFREF_STATE_Pos)         /*!< 0x00000200 */

/***************  Bit definition for DDRC_MRCTRL0 register  ****************/
#define DDRC_MRCTRL0_MR_TYPE_Pos (0U)
#define DDRC_MRCTRL0_MR_TYPE_Msk (0x1U << DDRC_MRCTRL0_MR_TYPE_Pos) /*!< 0x00000001 */
#define DDRC_MRCTRL0_MR_TYPE     DDRC_MRCTRL0_MR_TYPE_Msk           /*!< Indicates whether the mode register operation is read or write. Only used for LPDDR2/LPDDR3/LPDDR4/DDR4. */
#define DDRC_MRCTRL0_MR_RANK_Pos (4U)
#define DDRC_MRCTRL0_MR_RANK_Msk (0x1U << DDRC_MRCTRL0_MR_RANK_Pos) /*!< 0x00000010 */
#define DDRC_MRCTRL0_MR_RANK     DDRC_MRCTRL0_MR_RANK_Msk           /*!< Controls which rank is accessed by MRCTRL0.mr_wr. Normally, it is desired to access all ranks, so all bits should be set to 1. However, for multi-rank UDIMMs/RDIMMs/LRDIMMs which implement address mirroring, it may be necessary to access ranks individually. */
#define DDRC_MRCTRL0_MR_ADDR_Pos (12U)
#define DDRC_MRCTRL0_MR_ADDR_Msk (0xFU << DDRC_MRCTRL0_MR_ADDR_Pos) /*!< 0x0000F000 */
#define DDRC_MRCTRL0_MR_ADDR     DDRC_MRCTRL0_MR_ADDR_Msk           /*!< Address of the mode register that is to be written to. */
#define DDRC_MRCTRL0_MR_ADDR_0   (0x1U << DDRC_MRCTRL0_MR_ADDR_Pos) /*!< 0x00001000 */
#define DDRC_MRCTRL0_MR_ADDR_1   (0x2U << DDRC_MRCTRL0_MR_ADDR_Pos) /*!< 0x00002000 */
#define DDRC_MRCTRL0_MR_ADDR_2   (0x4U << DDRC_MRCTRL0_MR_ADDR_Pos) /*!< 0x00004000 */
#define DDRC_MRCTRL0_MR_ADDR_3   (0x8U << DDRC_MRCTRL0_MR_ADDR_Pos) /*!< 0x00008000 */
#define DDRC_MRCTRL0_MR_WR_Pos   (31U)
#define DDRC_MRCTRL0_MR_WR_Msk   (0x1U << DDRC_MRCTRL0_MR_WR_Pos)   /*!< 0x80000000 */
#define DDRC_MRCTRL0_MR_WR       DDRC_MRCTRL0_MR_WR_Msk             /*!< Setting this register bit to 1 triggers a mode register read or write operation. When the MR operation is complete, the DDRC automatically clears this bit. The other register fields of this register must be written in a separate APB transaction, before setting this mr_wr bit. It is recommended NOT to set this signal if in Init, Deep power-down or MPSM operating modes. */

/****************  Bit definition for DDRC_MRSTAT register  ****************/
#define DDRC_MRSTAT_MR_WR_BUSY_Pos (0U)
#define DDRC_MRSTAT_MR_WR_BUSY_Msk (0x1U << DDRC_MRSTAT_MR_WR_BUSY_Pos) /*!< 0x00000001 */
#define DDRC_MRSTAT_MR_WR_BUSY     DDRC_MRSTAT_MR_WR_BUSY_Msk           /*!< The SoC core may initiate a MR write operation only if this signal is low. This signal goes high in the clock after the DDRC accepts the MRW/MRR request. It goes low when the MRW/MRR command is issued to the SDRAM. It is recommended not to perform MRW/MRR commands when \qMRSTAT.mr_wr_busy\q is high. */

