STMicroelectronics/STM32PRGFW-UTIL/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp257cxx_ca35.h
/*************  Bit definition for ETH_DMAC1MFCR register  *************/
#define ETH_DMAC1MFCR_MFC_Pos               (0U)
#define ETH_DMAC1MFCR_MFC_Msk               (0x7FFU << ETH_DMAC1MFCR_MFC_Pos)                   /*!< 0x000007FF */
#define ETH_DMAC1MFCR_MFC                   ETH_DMAC1MFCR_MFC_Msk                               /*!< Dropped Packet Counters */
#define ETH_DMAC1MFCR_MFC_0                 (0x1U << ETH_DMAC1MFCR_MFC_Pos)                     /*!< 0x00000001 */
#define ETH_DMAC1MFCR_MFC_1                 (0x2U << ETH_DMAC1MFCR_MFC_Pos)                     /*!< 0x00000002 */
#define ETH_DMAC1MFCR_MFC_2                 (0x4U << ETH_DMAC1MFCR_MFC_Pos)                     /*!< 0x00000004 */
#define ETH_DMAC1MFCR_MFC_3                 (0x8U << ETH_DMAC1MFCR_MFC_Pos)                     /*!< 0x00000008 */
#define ETH_DMAC1MFCR_MFC_4                 (0x10U << ETH_DMAC1MFCR_MFC_Pos)                    /*!< 0x00000010 */
#define ETH_DMAC1MFCR_MFC_5                 (0x20U << ETH_DMAC1MFCR_MFC_Pos)                    /*!< 0x00000020 */
#define ETH_DMAC1MFCR_MFC_6                 (0x40U << ETH_DMAC1MFCR_MFC_Pos)                    /*!< 0x00000040 */
#define ETH_DMAC1MFCR_MFC_7                 (0x80U << ETH_DMAC1MFCR_MFC_Pos)                    /*!< 0x00000080 */
#define ETH_DMAC1MFCR_MFC_8                 (0x100U << ETH_DMAC1MFCR_MFC_Pos)                   /*!< 0x00000100 */
#define ETH_DMAC1MFCR_MFC_9                 (0x200U << ETH_DMAC1MFCR_MFC_Pos)                   /*!< 0x00000200 */
#define ETH_DMAC1MFCR_MFC_10                (0x400U << ETH_DMAC1MFCR_MFC_Pos)                   /*!< 0x00000400 */
#define ETH_DMAC1MFCR_MFCO_Pos              (15U)
#define ETH_DMAC1MFCR_MFCO_Msk              (0x1U << ETH_DMAC1MFCR_MFCO_Pos)                    /*!< 0x00008000 */
#define ETH_DMAC1MFCR_MFCO                  ETH_DMAC1MFCR_MFCO_Msk                              /*!< Overflow status of the MFC Counter */

/******************************************************************************/
/*                                                                            */
/*                Ethernet ACM MSG Registers bits definitions                 */
/*                                                                            */
/******************************************************************************/

/******************  Bit definition for ETH_ACMMSG_MSGBUFDESC register  *******************/
#define ETH_ACMMSG_MSGBUFDESC_OFFSET_Pos    (0U)
#define ETH_ACMMSG_MSGBUFDESC_OFFSET_Msk    (0xFFFFU << ETH_ACMMSG_MSGBUFDESC_OFFSET_Pos)         /*!< 0x0000FFFF */
#define ETH_ACMMSG_MSGBUFDESC_OFFSET        ETH_ACMMSG_MSGBUFDESC_OFFSET_Msk                      /*!< Buffer offset */
#define ETH_ACMMSG_MSGBUFDESC_RST_Pos       (19U)
#define ETH_ACMMSG_MSGBUFDESC_RST_Msk       (0x1U << ETH_ACMMSG_MSGBUFDESC_RST_Pos)               /*!< 0x00080000 */
#define ETH_ACMMSG_MSGBUFDESC_RST           ETH_ACMMSG_MSGBUFDESC_RST_Msk                         /*!< Buffer reset */
#define ETH_ACMMSG_MSGBUFDESC_TYPE_Pos      (20U)
#define ETH_ACMMSG_MSGBUFDESC_TYPE_Msk      (0x1U << ETH_ACMMSG_MSGBUFDESC_TYPE_Pos)              /*!< 0x00100000 */
#define ETH_ACMMSG_MSGBUFDESC_TYPE          ETH_ACMMSG_MSGBUFDESC_TYPE_Msk                        /*!< Buffer type */
#define ETH_ACMMSG_MSGBUFDESC_SUBSIZE_Pos   (21U)
#define ETH_ACMMSG_MSGBUFDESC_SUBSIZE_Msk   (0x1FFU << ETH_ACMMSG_MSGBUFDESC_SUBSIZE_Pos)         /*!< 0x3FE00000 */
#define ETH_ACMMSG_MSGBUFDESC_SUBSIZE       ETH_ACMMSG_MSGBUFDESC_SUBSIZE_Msk                     /*!< Sub Buffer size */
#define ETH_ACMMSG_MSGBUFDESC_VALID_Pos     (31U)
#define ETH_ACMMSG_MSGBUFDESC_VALID_Msk     (0x1U << ETH_ACMMSG_MSGBUFDESC_VALID_Pos)             /*!< 0x80000000 */
#define ETH_ACMMSG_MSGBUFDESC_VALID         ETH_ACMMSG_MSGBUFDESC_VALID_Msk                       /*!< Valid */

/******************  Bit definition for ETH_ACMMSG_LOCKCTRLLOW register  *******************/
#define ETH_ACMMSG_LOCKCTRLLOW_Pos          (0U)
#define ETH_ACMMSG_LOCKCTRLLOW_Msk          (0xFFFFFFFFU << ETHH_ACMMSG_LOCKCTRLLOW_Pos)   /*!< 0xFFFFFFFF */
#define ETH_ACMMSG_LOCKCTRLLOW              ETHH_ACMMSG_LOCKCTRLLOW_Msk                    /*!< Locking control low */
#define ETH_ACMMSG_LOCKCTRLLOW_0            (0x1U << ETH_ACMMSG_LOCKCTRLLOW_Pos)           /*!< 0x00000001 */
#define ETH_ACMMSG_LOCKCTRLLOW_1            (0x2U << ETH_ACMMSG_LOCKCTRLLOW_Pos)           /*!< 0x00000002 */
#define ETH_ACMMSG_LOCKCTRLLOW_2            (0x4U << ETH_ACMMSG_LOCKCTRLLOW_Pos)           /*!< 0x00000004 */
#define ETH_ACMMSG_LOCKCTRLLOW_3            (0x8U << ETH_ACMMSG_LOCKCTRLLOW_Pos)           /*!< 0x00000008 */
#define ETH_ACMMSG_LOCKCTRLLOW_4            (0x10U << ETH_ACMMSG_LOCKCTRLLOW_Pos)          /*!< 0x00000010 */
#define ETH_ACMMSG_LOCKCTRLLOW_5            (0x20U << ETH_ACMMSG_LOCKCTRLLOW_Pos)          /*!< 0x00000020 */
#define ETH_ACMMSG_LOCKCTRLLOW_6            (0x40U << ETH_ACMMSG_LOCKCTRLLOW_Pos)          /*!< 0x00000040 */
#define ETH_ACMMSG_LOCKCTRLLOW_7            (0x80U << ETH_ACMMSG_LOCKCTRLLOW_Pos)          /*!< 0x00000080 */
#define ETH_ACMMSG_LOCKCTRLLOW_8            (0x100U << ETH_ACMMSG_LOCKCTRLLOW_Pos)         /*!< 0x00000100 */
#define ETH_ACMMSG_LOCKCTRLLOW_9            (0x200U << ETH_ACMMSG_LOCKCTRLLOW_Pos)         /*!< 0x00000200 */
#define ETH_ACMMSG_LOCKCTRLLOW_10           (0x400U << ETH_ACMMSG_LOCKCTRLLOW_Pos)         /*!< 0x00000400 */
#define ETH_ACMMSG_LOCKCTRLLOW_11           (0x800U << ETH_ACMMSG_LOCKCTRLLOW_Pos)         /*!< 0x00000800 */
#define ETH_ACMMSG_LOCKCTRLLOW_12           (0x1000U << ETH_ACMMSG_LOCKCTRLLOW_Pos)        /*!< 0x00001000 */
#define ETH_ACMMSG_LOCKCTRLLOW_13           (0x2000U << ETH_ACMMSG_LOCKCTRLLOW_Pos)        /*!< 0x00002000 */
#define ETH_ACMMSG_LOCKCTRLLOW_14           (0x4000U << ETH_ACMMSG_LOCKCTRLLOW_Pos)        /*!< 0x00004000 */
#define ETH_ACMMSG_LOCKCTRLLOW_15           (0x8000U << ETH_ACMMSG_LOCKCTRLLOW_Pos)        /*!< 0x00008000 */
#define ETH_ACMMSG_LOCKCTRLLOW_16           (0x10000U << ETH_ACMMSG_LOCKCTRLLOW_Pos)       /*!< 0x00010000 */
#define ETH_ACMMSG_LOCKCTRLLOW_17           (0x20000U << ETH_ACMMSG_LOCKCTRLLOW_Pos)       /*!< 0x00020000 */
#define ETH_ACMMSG_LOCKCTRLLOW_18           (0x40000U << ETH_ACMMSG_LOCKCTRLLOW_Pos)       /*!< 0x00040000 */
#define ETH_ACMMSG_LOCKCTRLLOW_19           (0x80000U << ETH_ACMMSG_LOCKCTRLLOW_Pos)       /*!< 0x00080000 */
#define ETH_ACMMSG_LOCKCTRLLOW_20           (0x100000U << ETH_ACMMSG_LOCKCTRLLOW_Pos)      /*!< 0x00100000 */
#define ETH_ACMMSG_LOCKCTRLLOW_21           (0x200000U << ETH_ACMMSG_LOCKCTRLLOW_Pos)      /*!< 0x00200000 */
#define ETH_ACMMSG_LOCKCTRLLOW_22           (0x400000U << ETH_ACMMSG_LOCKCTRLLOW_Pos)      /*!< 0x00400000 */
#define ETH_ACMMSG_LOCKCTRLLOW_23           (0x800000U << ETH_ACMMSG_LOCKCTRLLOW_Pos)      /*!< 0x00800000 */
#define ETH_ACMMSG_LOCKCTRLLOW_24           (0x1000000U << ETH_ACMMSG_LOCKCTRLLOW_Pos)     /*!< 0x01000000 */
#define ETH_ACMMSG_LOCKCTRLLOW_25           (0x2000000U << ETH_ACMMSG_LOCKCTRLLOW_Pos)     /*!< 0x02000000 */
#define ETH_ACMMSG_LOCKCTRLLOW_26           (0x4000000U << ETH_ACMMSG_LOCKCTRLLOW_Pos)     /*!< 0x04000000 */
#define ETH_ACMMSG_LOCKCTRLLOW_27           (0x8000000U << ETH_ACMMSG_LOCKCTRLLOW_Pos)     /*!< 0x08000000 */
#define ETH_ACMMSG_LOCKCTRLLOW_28           (0x10000000U << ETH_ACMMSG_LOCKCTRLLOW_Pos)    /*!< 0x10000000 */
#define ETH_ACMMSG_LOCKCTRLLOW_29           (0x20000000U << ETH_ACMMSG_LOCKCTRLLOW_Pos)    /*!< 0x20000000 */
#define ETH_ACMMSG_LOCKCTRLLOW_30           (0x40000000U << ETH_ACMMSG_LOCKCTRLLOW_Pos)    /*!< 0x40000000 */
#define ETH_ACMMSG_LOCKCTRLLOW_31           (0x80000000U << ETH_ACMMSG_LOCKCTRLLOW_Pos)    /*!< 0x80000000 */

/******************  Bit definition for ETH_ACMMSG_LOCKCTRLHIGH register  *******************/
#define ETH_ACMMSG_LOCKCTRLHIGH_Pos         (0U)
#define ETH_ACMMSG_LOCKCTRLHIGH_Msk         (0xFFFFFFFFU << ETHH_ACMMSG_LOCKCTRLHIGH_Pos)   /*!< 0xFFFFFFFF */
#define ETH_ACMMSG_LOCKCTRLHIGH             ETHH_ACMMSG_LOCKCTRLHIGH_Msk                    /*!< Locking control high */
#define ETH_ACMMSG_LOCKCTRLHIGH_0           (0x1U << ETH_ACMMSG_LOCKCTRLHIGH_Pos)           /*!< 0x00000001 */
#define ETH_ACMMSG_LOCKCTRLHIGH_1           (0x2U << ETH_ACMMSG_LOCKCTRLHIGH_Pos)           /*!< 0x00000002 */
#define ETH_ACMMSG_LOCKCTRLHIGH_2           (0x4U << ETH_ACMMSG_LOCKCTRLHIGH_Pos)           /*!< 0x00000004 */
#define ETH_ACMMSG_LOCKCTRLHIGH_3           (0x8U << ETH_ACMMSG_LOCKCTRLHIGH_Pos)           /*!< 0x00000008 */
#define ETH_ACMMSG_LOCKCTRLHIGH_4           (0x10U << ETH_ACMMSG_LOCKCTRLHIGH_Pos)          /*!< 0x00000010 */
#define ETH_ACMMSG_LOCKCTRLHIGH_5           (0x20U << ETH_ACMMSG_LOCKCTRLHIGH_Pos)          /*!< 0x00000020 */
#define ETH_ACMMSG_LOCKCTRLHIGH_6           (0x40U << ETH_ACMMSG_LOCKCTRLHIGH_Pos)          /*!< 0x00000040 */
#define ETH_ACMMSG_LOCKCTRLHIGH_7           (0x80U << ETH_ACMMSG_LOCKCTRLHIGH_Pos)          /*!< 0x00000080 */
#define ETH_ACMMSG_LOCKCTRLHIGH_8           (0x100U << ETH_ACMMSG_LOCKCTRLHIGH_Pos)         /*!< 0x00000100 */
#define ETH_ACMMSG_LOCKCTRLHIGH_9           (0x200U << ETH_ACMMSG_LOCKCTRLHIGH_Pos)         /*!< 0x00000200 */
#define ETH_ACMMSG_LOCKCTRLHIGH_10          (0x400U << ETH_ACMMSG_LOCKCTRLHIGH_Pos)         /*!< 0x00000400 */
#define ETH_ACMMSG_LOCKCTRLHIGH_11          (0x800U << ETH_ACMMSG_LOCKCTRLHIGH_Pos)         /*!< 0x00000800 */
#define ETH_ACMMSG_LOCKCTRLHIGH_12          (0x1000U << ETH_ACMMSG_LOCKCTRLHIGH_Pos)        /*!< 0x00001000 */
#define ETH_ACMMSG_LOCKCTRLHIGH_13          (0x2000U << ETH_ACMMSG_LOCKCTRLHIGH_Pos)        /*!< 0x00002000 */
#define ETH_ACMMSG_LOCKCTRLHIGH_14          (0x4000U << ETH_ACMMSG_LOCKCTRLHIGH_Pos)        /*!< 0x00004000 */
#define ETH_ACMMSG_LOCKCTRLHIGH_15          (0x8000U << ETH_ACMMSG_LOCKCTRLHIGH_Pos)        /*!< 0x00008000 */
#define ETH_ACMMSG_LOCKCTRLHIGH_16          (0x10000U << ETH_ACMMSG_LOCKCTRLHIGH_Pos)       /*!< 0x00010000 */
#define ETH_ACMMSG_LOCKCTRLHIGH_17          (0x20000U << ETH_ACMMSG_LOCKCTRLHIGH_Pos)       /*!< 0x00020000 */
#define ETH_ACMMSG_LOCKCTRLHIGH_18          (0x40000U << ETH_ACMMSG_LOCKCTRLHIGH_Pos)       /*!< 0x00040000 */
#define ETH_ACMMSG_LOCKCTRLHIGH_19          (0x80000U << ETH_ACMMSG_LOCKCTRLHIGH_Pos)       /*!< 0x00080000 */
#define ETH_ACMMSG_LOCKCTRLHIGH_20          (0x100000U << ETH_ACMMSG_LOCKCTRLHIGH_Pos)      /*!< 0x00100000 */
#define ETH_ACMMSG_LOCKCTRLHIGH_21          (0x200000U << ETH_ACMMSG_LOCKCTRLHIGH_Pos)      /*!< 0x00200000 */
#define ETH_ACMMSG_LOCKCTRLHIGH_22          (0x400000U << ETH_ACMMSG_LOCKCTRLHIGH_Pos)      /*!< 0x00400000 */
#define ETH_ACMMSG_LOCKCTRLHIGH_23          (0x800000U << ETH_ACMMSG_LOCKCTRLHIGH_Pos)      /*!< 0x00800000 */
#define ETH_ACMMSG_LOCKCTRLHIGH_24          (0x1000000U << ETH_ACMMSG_LOCKCTRLHIGH_Pos)     /*!< 0x01000000 */
#define ETH_ACMMSG_LOCKCTRLHIGH_25          (0x2000000U << ETH_ACMMSG_LOCKCTRLHIGH_Pos)     /*!< 0x02000000 */
#define ETH_ACMMSG_LOCKCTRLHIGH_26          (0x4000000U << ETH_ACMMSG_LOCKCTRLHIGH_Pos)     /*!< 0x04000000 */
#define ETH_ACMMSG_LOCKCTRLHIGH_27          (0x8000000U << ETH_ACMMSG_LOCKCTRLHIGH_Pos)     /*!< 0x08000000 */
#define ETH_ACMMSG_LOCKCTRLHIGH_28          (0x10000000U << ETH_ACMMSG_LOCKCTRLHIGH_Pos)    /*!< 0x10000000 */
#define ETH_ACMMSG_LOCKCTRLHIGH_29          (0x20000000U << ETH_ACMMSG_LOCKCTRLHIGH_Pos)    /*!< 0x20000000 */
#define ETH_ACMMSG_LOCKCTRLHIGH_30          (0x40000000U << ETH_ACMMSG_LOCKCTRLHIGH_Pos)    /*!< 0x40000000 */
#define ETH_ACMMSG_LOCKCTRLHIGH_31          (0x80000000U << ETH_ACMMSG_LOCKCTRLHIGH_Pos)    /*!< 0x80000000 */

