STMicroelectronics/STM32PRGFW-UTIL/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp257cxx_ca35.h
/******************  Bit definition for IPCC_C1SCR register  ******************/
#define IPCC_C1SCR_CH1C_Pos           (0U)
#define IPCC_C1SCR_CH1C_Msk           (0x1U << IPCC_C1SCR_CH1C_Pos)           /*!< 0x00000001 */
#define IPCC_C1SCR_CH1C               IPCC_C1SCR_CH1C_Msk                     /*!< Processor 1 Receive channel n status clear */
#define IPCC_C1SCR_CH2C_Pos           (1U)
#define IPCC_C1SCR_CH2C_Msk           (0x1U << IPCC_C1SCR_CH2C_Pos)           /*!< 0x00000002 */
#define IPCC_C1SCR_CH2C               IPCC_C1SCR_CH2C_Msk                     /*!< Processor 1 Receive channel n status clear */
#define IPCC_C1SCR_CH3C_Pos           (2U)
#define IPCC_C1SCR_CH3C_Msk           (0x1U << IPCC_C1SCR_CH3C_Pos)           /*!< 0x00000004 */
#define IPCC_C1SCR_CH3C               IPCC_C1SCR_CH3C_Msk                     /*!< Processor 1 Receive channel n status clear */
#define IPCC_C1SCR_CH4C_Pos           (3U)
#define IPCC_C1SCR_CH4C_Msk           (0x1U << IPCC_C1SCR_CH4C_Pos)           /*!< 0x00000008 */
#define IPCC_C1SCR_CH4C               IPCC_C1SCR_CH4C_Msk                     /*!< Processor 1 Receive channel n status clear */
#define IPCC_C1SCR_CH5C_Pos           (4U)
#define IPCC_C1SCR_CH5C_Msk           (0x1U << IPCC_C1SCR_CH5C_Pos)           /*!< 0x00000010 */
#define IPCC_C1SCR_CH5C               IPCC_C1SCR_CH5C_Msk                     /*!< Processor 1 Receive channel n status clear */
#define IPCC_C1SCR_CH6C_Pos           (5U)
#define IPCC_C1SCR_CH6C_Msk           (0x1U << IPCC_C1SCR_CH6C_Pos)           /*!< 0x00000020 */
#define IPCC_C1SCR_CH6C               IPCC_C1SCR_CH6C_Msk                     /*!< Processor 1 Receive channel n status clear */
#define IPCC_C1SCR_CH7C_Pos           (6U)
#define IPCC_C1SCR_CH7C_Msk           (0x1U << IPCC_C1SCR_CH7C_Pos)           /*!< 0x00000040 */
#define IPCC_C1SCR_CH7C               IPCC_C1SCR_CH7C_Msk                     /*!< Processor 1 Receive channel n status clear */
#define IPCC_C1SCR_CH8C_Pos           (7U)
#define IPCC_C1SCR_CH8C_Msk           (0x1U << IPCC_C1SCR_CH8C_Pos)           /*!< 0x00000080 */
#define IPCC_C1SCR_CH8C               IPCC_C1SCR_CH8C_Msk                     /*!< Processor 1 Receive channel n status clear */
#define IPCC_C1SCR_CH9C_Pos           (8U)
#define IPCC_C1SCR_CH9C_Msk           (0x1U << IPCC_C1SCR_CH9C_Pos)           /*!< 0x00000100 */
#define IPCC_C1SCR_CH9C               IPCC_C1SCR_CH9C_Msk                     /*!< Processor 1 Receive channel n status clear */
#define IPCC_C1SCR_CH10C_Pos          (9U)
#define IPCC_C1SCR_CH10C_Msk          (0x1U << IPCC_C1SCR_CH10C_Pos)          /*!< 0x00000200 */
#define IPCC_C1SCR_CH10C              IPCC_C1SCR_CH10C_Msk                    /*!< Processor 1 Receive channel n status clear */
#define IPCC_C1SCR_CH11C_Pos          (10U)
#define IPCC_C1SCR_CH11C_Msk          (0x1U << IPCC_C1SCR_CH11C_Pos)          /*!< 0x00000400 */
#define IPCC_C1SCR_CH11C              IPCC_C1SCR_CH11C_Msk                    /*!< Processor 1 Receive channel n status clear */
#define IPCC_C1SCR_CH12C_Pos          (11U)
#define IPCC_C1SCR_CH12C_Msk          (0x1U << IPCC_C1SCR_CH12C_Pos)          /*!< 0x00000800 */
#define IPCC_C1SCR_CH12C              IPCC_C1SCR_CH12C_Msk                    /*!< Processor 1 Receive channel n status clear */
#define IPCC_C1SCR_CH13C_Pos          (12U)
#define IPCC_C1SCR_CH13C_Msk          (0x1U << IPCC_C1SCR_CH13C_Pos)          /*!< 0x00001000 */
#define IPCC_C1SCR_CH13C              IPCC_C1SCR_CH13C_Msk                    /*!< Processor 1 Receive channel n status clear */
#define IPCC_C1SCR_CH14C_Pos          (13U)
#define IPCC_C1SCR_CH14C_Msk          (0x1U << IPCC_C1SCR_CH14C_Pos)          /*!< 0x00002000 */
#define IPCC_C1SCR_CH14C              IPCC_C1SCR_CH14C_Msk                    /*!< Processor 1 Receive channel n status clear */
#define IPCC_C1SCR_CH15C_Pos          (14U)
#define IPCC_C1SCR_CH15C_Msk          (0x1U << IPCC_C1SCR_CH15C_Pos)          /*!< 0x00004000 */
#define IPCC_C1SCR_CH15C              IPCC_C1SCR_CH15C_Msk                    /*!< Processor 1 Receive channel n status clear */
#define IPCC_C1SCR_CH16C_Pos          (15U)
#define IPCC_C1SCR_CH16C_Msk          (0x1U << IPCC_C1SCR_CH16C_Pos)          /*!< 0x00008000 */
#define IPCC_C1SCR_CH16C              IPCC_C1SCR_CH16C_Msk                    /*!< Processor 1 Receive channel n status clear */
#define IPCC_C1SCR_CH1S_Pos           (16U)
#define IPCC_C1SCR_CH1S_Msk           (0x1U << IPCC_C1SCR_CH1S_Pos)           /*!< 0x00010000 */
#define IPCC_C1SCR_CH1S               IPCC_C1SCR_CH1S_Msk                     /*!< Processor 1 transmit channel n status set */
#define IPCC_C1SCR_CH2S_Pos           (17U)
#define IPCC_C1SCR_CH2S_Msk           (0x1U << IPCC_C1SCR_CH2S_Pos)           /*!< 0x00020000 */
#define IPCC_C1SCR_CH2S               IPCC_C1SCR_CH2S_Msk                     /*!< Processor 1 transmit channel n status set */
#define IPCC_C1SCR_CH3S_Pos           (18U)
#define IPCC_C1SCR_CH3S_Msk           (0x1U << IPCC_C1SCR_CH3S_Pos)           /*!< 0x00040000 */
#define IPCC_C1SCR_CH3S               IPCC_C1SCR_CH3S_Msk                     /*!< Processor 1 transmit channel n status set */
#define IPCC_C1SCR_CH4S_Pos           (19U)
#define IPCC_C1SCR_CH4S_Msk           (0x1U << IPCC_C1SCR_CH4S_Pos)           /*!< 0x00080000 */
#define IPCC_C1SCR_CH4S               IPCC_C1SCR_CH4S_Msk                     /*!< Processor 1 transmit channel n status set */
#define IPCC_C1SCR_CH5S_Pos           (20U)
#define IPCC_C1SCR_CH5S_Msk           (0x1U << IPCC_C1SCR_CH5S_Pos)           /*!< 0x00100000 */
#define IPCC_C1SCR_CH5S               IPCC_C1SCR_CH5S_Msk                     /*!< Processor 1 transmit channel n status set */
#define IPCC_C1SCR_CH6S_Pos           (21U)
#define IPCC_C1SCR_CH6S_Msk           (0x1U << IPCC_C1SCR_CH6S_Pos)           /*!< 0x00200000 */
#define IPCC_C1SCR_CH6S               IPCC_C1SCR_CH6S_Msk                     /*!< Processor 1 transmit channel n status set */
#define IPCC_C1SCR_CH7S_Pos           (22U)
#define IPCC_C1SCR_CH7S_Msk           (0x1U << IPCC_C1SCR_CH7S_Pos)           /*!< 0x00400000 */
#define IPCC_C1SCR_CH7S               IPCC_C1SCR_CH7S_Msk                     /*!< Processor 1 transmit channel n status set */
#define IPCC_C1SCR_CH8S_Pos           (23U)
#define IPCC_C1SCR_CH8S_Msk           (0x1U << IPCC_C1SCR_CH8S_Pos)           /*!< 0x00800000 */
#define IPCC_C1SCR_CH8S               IPCC_C1SCR_CH8S_Msk                     /*!< Processor 1 transmit channel n status set */
#define IPCC_C1SCR_CH9S_Pos           (24U)
#define IPCC_C1SCR_CH9S_Msk           (0x1U << IPCC_C1SCR_CH9S_Pos)           /*!< 0x01000000 */
#define IPCC_C1SCR_CH9S               IPCC_C1SCR_CH9S_Msk                     /*!< Processor 1 transmit channel n status set */
#define IPCC_C1SCR_CH10S_Pos          (25U)
#define IPCC_C1SCR_CH10S_Msk          (0x1U << IPCC_C1SCR_CH10S_Pos)          /*!< 0x02000000 */
#define IPCC_C1SCR_CH10S              IPCC_C1SCR_CH10S_Msk                    /*!< Processor 1 transmit channel n status set */
#define IPCC_C1SCR_CH11S_Pos          (26U)
#define IPCC_C1SCR_CH11S_Msk          (0x1U << IPCC_C1SCR_CH11S_Pos)          /*!< 0x04000000 */
#define IPCC_C1SCR_CH11S              IPCC_C1SCR_CH11S_Msk                    /*!< Processor 1 transmit channel n status set */
#define IPCC_C1SCR_CH12S_Pos          (27U)
#define IPCC_C1SCR_CH12S_Msk          (0x1U << IPCC_C1SCR_CH12S_Pos)          /*!< 0x08000000 */
#define IPCC_C1SCR_CH12S              IPCC_C1SCR_CH12S_Msk                    /*!< Processor 1 transmit channel n status set */
#define IPCC_C1SCR_CH13S_Pos          (28U)
#define IPCC_C1SCR_CH13S_Msk          (0x1U << IPCC_C1SCR_CH13S_Pos)          /*!< 0x10000000 */
#define IPCC_C1SCR_CH13S              IPCC_C1SCR_CH13S_Msk                    /*!< Processor 1 transmit channel n status set */
#define IPCC_C1SCR_CH14S_Pos          (29U)
#define IPCC_C1SCR_CH14S_Msk          (0x1U << IPCC_C1SCR_CH14S_Pos)          /*!< 0x20000000 */
#define IPCC_C1SCR_CH14S              IPCC_C1SCR_CH14S_Msk                    /*!< Processor 1 transmit channel n status set */
#define IPCC_C1SCR_CH15S_Pos          (30U)
#define IPCC_C1SCR_CH15S_Msk          (0x1U << IPCC_C1SCR_CH15S_Pos)          /*!< 0x40000000 */
#define IPCC_C1SCR_CH15S              IPCC_C1SCR_CH15S_Msk                    /*!< Processor 1 transmit channel n status set */
#define IPCC_C1SCR_CH16S_Pos          (31U)
#define IPCC_C1SCR_CH16S_Msk          (0x1U << IPCC_C1SCR_CH16S_Pos)          /*!< 0x80000000 */
#define IPCC_C1SCR_CH16S              IPCC_C1SCR_CH16S_Msk                    /*!< Processor 1 transmit channel n status set */

/****************  Bit definition for IPCC_C1TOC2SR register  *****************/
#define IPCC_C1TOC2SR_CH1F_Pos        (0U)
#define IPCC_C1TOC2SR_CH1F_Msk        (0x1U << IPCC_C1TOC2SR_CH1F_Pos)        /*!< 0x00000001 */
#define IPCC_C1TOC2SR_CH1F            IPCC_C1TOC2SR_CH1F_Msk                  /*!< Processor 1 transmit to processor 2 receive channel n status flag before masking */
#define IPCC_C1TOC2SR_CH2F_Pos        (1U)
#define IPCC_C1TOC2SR_CH2F_Msk        (0x1U << IPCC_C1TOC2SR_CH2F_Pos)        /*!< 0x00000002 */
#define IPCC_C1TOC2SR_CH2F            IPCC_C1TOC2SR_CH2F_Msk                  /*!< Processor 1 transmit to processor 2 receive channel n status flag before masking */
#define IPCC_C1TOC2SR_CH3F_Pos        (2U)
#define IPCC_C1TOC2SR_CH3F_Msk        (0x1U << IPCC_C1TOC2SR_CH3F_Pos)        /*!< 0x00000004 */
#define IPCC_C1TOC2SR_CH3F            IPCC_C1TOC2SR_CH3F_Msk                  /*!< Processor 1 transmit to processor 2 receive channel n status flag before masking */
#define IPCC_C1TOC2SR_CH4F_Pos        (3U)
#define IPCC_C1TOC2SR_CH4F_Msk        (0x1U << IPCC_C1TOC2SR_CH4F_Pos)        /*!< 0x00000008 */
#define IPCC_C1TOC2SR_CH4F            IPCC_C1TOC2SR_CH4F_Msk                  /*!< Processor 1 transmit to processor 2 receive channel n status flag before masking */
#define IPCC_C1TOC2SR_CH5F_Pos        (4U)
#define IPCC_C1TOC2SR_CH5F_Msk        (0x1U << IPCC_C1TOC2SR_CH5F_Pos)        /*!< 0x00000010 */
#define IPCC_C1TOC2SR_CH5F            IPCC_C1TOC2SR_CH5F_Msk                  /*!< Processor 1 transmit to processor 2 receive channel n status flag before masking */
#define IPCC_C1TOC2SR_CH6F_Pos        (5U)
#define IPCC_C1TOC2SR_CH6F_Msk        (0x1U << IPCC_C1TOC2SR_CH6F_Pos)        /*!< 0x00000020 */
#define IPCC_C1TOC2SR_CH6F            IPCC_C1TOC2SR_CH6F_Msk                  /*!< Processor 1 transmit to processor 2 receive channel n status flag before masking */
#define IPCC_C1TOC2SR_CH7F_Pos        (6U)
#define IPCC_C1TOC2SR_CH7F_Msk        (0x1U << IPCC_C1TOC2SR_CH7F_Pos)        /*!< 0x00000040 */
#define IPCC_C1TOC2SR_CH7F            IPCC_C1TOC2SR_CH7F_Msk                  /*!< Processor 1 transmit to processor 2 receive channel n status flag before masking */
#define IPCC_C1TOC2SR_CH8F_Pos        (7U)
#define IPCC_C1TOC2SR_CH8F_Msk        (0x1U << IPCC_C1TOC2SR_CH8F_Pos)        /*!< 0x00000080 */
#define IPCC_C1TOC2SR_CH8F            IPCC_C1TOC2SR_CH8F_Msk                  /*!< Processor 1 transmit to processor 2 receive channel n status flag before masking */
#define IPCC_C1TOC2SR_CH9F_Pos        (8U)
#define IPCC_C1TOC2SR_CH9F_Msk        (0x1U << IPCC_C1TOC2SR_CH9F_Pos)        /*!< 0x00000100 */
#define IPCC_C1TOC2SR_CH9F            IPCC_C1TOC2SR_CH9F_Msk                  /*!< Processor 1 transmit to processor 2 receive channel n status flag before masking */
#define IPCC_C1TOC2SR_CH10F_Pos       (9U)
#define IPCC_C1TOC2SR_CH10F_Msk       (0x1U << IPCC_C1TOC2SR_CH10F_Pos)       /*!< 0x00000200 */
#define IPCC_C1TOC2SR_CH10F           IPCC_C1TOC2SR_CH10F_Msk                 /*!< Processor 1 transmit to processor 2 receive channel n status flag before masking */
#define IPCC_C1TOC2SR_CH11F_Pos       (10U)
#define IPCC_C1TOC2SR_CH11F_Msk       (0x1U << IPCC_C1TOC2SR_CH11F_Pos)       /*!< 0x00000400 */
#define IPCC_C1TOC2SR_CH11F           IPCC_C1TOC2SR_CH11F_Msk                 /*!< Processor 1 transmit to processor 2 receive channel n status flag before masking */
#define IPCC_C1TOC2SR_CH12F_Pos       (11U)
#define IPCC_C1TOC2SR_CH12F_Msk       (0x1U << IPCC_C1TOC2SR_CH12F_Pos)       /*!< 0x00000800 */
#define IPCC_C1TOC2SR_CH12F           IPCC_C1TOC2SR_CH12F_Msk                 /*!< Processor 1 transmit to processor 2 receive channel n status flag before masking */
#define IPCC_C1TOC2SR_CH13F_Pos       (12U)
#define IPCC_C1TOC2SR_CH13F_Msk       (0x1U << IPCC_C1TOC2SR_CH13F_Pos)       /*!< 0x00001000 */
#define IPCC_C1TOC2SR_CH13F           IPCC_C1TOC2SR_CH13F_Msk                 /*!< Processor 1 transmit to processor 2 receive channel n status flag before masking */
#define IPCC_C1TOC2SR_CH14F_Pos       (13U)
#define IPCC_C1TOC2SR_CH14F_Msk       (0x1U << IPCC_C1TOC2SR_CH14F_Pos)       /*!< 0x00002000 */
#define IPCC_C1TOC2SR_CH14F           IPCC_C1TOC2SR_CH14F_Msk                 /*!< Processor 1 transmit to processor 2 receive channel n status flag before masking */
#define IPCC_C1TOC2SR_CH15F_Pos       (14U)
#define IPCC_C1TOC2SR_CH15F_Msk       (0x1U << IPCC_C1TOC2SR_CH15F_Pos)       /*!< 0x00004000 */
#define IPCC_C1TOC2SR_CH15F           IPCC_C1TOC2SR_CH15F_Msk                 /*!< Processor 1 transmit to processor 2 receive channel n status flag before masking */
#define IPCC_C1TOC2SR_CH16F_Pos       (15U)
#define IPCC_C1TOC2SR_CH16F_Msk       (0x1U << IPCC_C1TOC2SR_CH16F_Pos)       /*!< 0x00008000 */
#define IPCC_C1TOC2SR_CH16F           IPCC_C1TOC2SR_CH16F_Msk                 /*!< Processor 1 transmit to processor 2 receive channel n status flag before masking */

/******************  Bit definition for IPCC_C2CR register  *******************/
#define IPCC_C2CR_RXOIE_Pos           (0U)
#define IPCC_C2CR_RXOIE_Msk           (0x1U << IPCC_C2CR_RXOIE_Pos)           /*!< 0x00000001 */
#define IPCC_C2CR_RXOIE               IPCC_C2CR_RXOIE_Msk                     /*!< Processor 2 non-secure Receive channel occupied interrupt enable */
#define IPCC_C2CR_SECRXOIE_Pos        (1U)
#define IPCC_C2CR_SECRXOIE_Msk        (0x1U << IPCC_C2CR_SECRXOIE_Pos)        /*!< 0x00000002 */
#define IPCC_C2CR_SECRXOIE            IPCC_C2CR_SECRXOIE_Msk                  /*!< Processor 2 secure Receive channel occupied interrupt enable */
#define IPCC_C2CR_TXFIE_Pos           (16U)
#define IPCC_C2CR_TXFIE_Msk           (0x1U << IPCC_C2CR_TXFIE_Pos)           /*!< 0x00010000 */
#define IPCC_C2CR_TXFIE               IPCC_C2CR_TXFIE_Msk                     /*!< Processor 2 non-secure Transmit channel free interrupt enable */
#define IPCC_C2CR_SECTXFIE_Pos        (17U)
#define IPCC_C2CR_SECTXFIE_Msk        (0x1U << IPCC_C2CR_SECTXFIE_Pos)        /*!< 0x00020000 */
#define IPCC_C2CR_SECTXFIE            IPCC_C2CR_SECTXFIE_Msk                  /*!< Processor 2 secure Transmit channel free interrupt enable */

/******************  Bit definition for IPCC_C2MR register  *******************/
#define IPCC_C2MR_CH1OM_Pos           (0U)
#define IPCC_C2MR_CH1OM_Msk           (0x1U << IPCC_C2MR_CH1OM_Pos)           /*!< 0x00000001 */
#define IPCC_C2MR_CH1OM               IPCC_C2MR_CH1OM_Msk                     /*!< Processor 2 receive channel n occupied interrupt mask */
#define IPCC_C2MR_CH2OM_Pos           (1U)
#define IPCC_C2MR_CH2OM_Msk           (0x1U << IPCC_C2MR_CH2OM_Pos)           /*!< 0x00000002 */
#define IPCC_C2MR_CH2OM               IPCC_C2MR_CH2OM_Msk                     /*!< Processor 2 receive channel n occupied interrupt mask */
#define IPCC_C2MR_CH3OM_Pos           (2U)
#define IPCC_C2MR_CH3OM_Msk           (0x1U << IPCC_C2MR_CH3OM_Pos)           /*!< 0x00000004 */
#define IPCC_C2MR_CH3OM               IPCC_C2MR_CH3OM_Msk                     /*!< Processor 2 receive channel n occupied interrupt mask */
#define IPCC_C2MR_CH4OM_Pos           (3U)
#define IPCC_C2MR_CH4OM_Msk           (0x1U << IPCC_C2MR_CH4OM_Pos)           /*!< 0x00000008 */
#define IPCC_C2MR_CH4OM               IPCC_C2MR_CH4OM_Msk                     /*!< Processor 2 receive channel n occupied interrupt mask */
#define IPCC_C2MR_CH5OM_Pos           (4U)
#define IPCC_C2MR_CH5OM_Msk           (0x1U << IPCC_C2MR_CH5OM_Pos)           /*!< 0x00000010 */
#define IPCC_C2MR_CH5OM               IPCC_C2MR_CH5OM_Msk                     /*!< Processor 2 receive channel n occupied interrupt mask */
#define IPCC_C2MR_CH6OM_Pos           (5U)
#define IPCC_C2MR_CH6OM_Msk           (0x1U << IPCC_C2MR_CH6OM_Pos)           /*!< 0x00000020 */
#define IPCC_C2MR_CH6OM               IPCC_C2MR_CH6OM_Msk                     /*!< Processor 2 receive channel n occupied interrupt mask */
#define IPCC_C2MR_CH7OM_Pos           (6U)
#define IPCC_C2MR_CH7OM_Msk           (0x1U << IPCC_C2MR_CH7OM_Pos)           /*!< 0x00000040 */
#define IPCC_C2MR_CH7OM               IPCC_C2MR_CH7OM_Msk                     /*!< Processor 2 receive channel n occupied interrupt mask */
#define IPCC_C2MR_CH8OM_Pos           (7U)
#define IPCC_C2MR_CH8OM_Msk           (0x1U << IPCC_C2MR_CH8OM_Pos)           /*!< 0x00000080 */
#define IPCC_C2MR_CH8OM               IPCC_C2MR_CH8OM_Msk                     /*!< Processor 2 receive channel n occupied interrupt mask */
#define IPCC_C2MR_CH9OM_Pos           (8U)
#define IPCC_C2MR_CH9OM_Msk           (0x1U << IPCC_C2MR_CH9OM_Pos)           /*!< 0x00000100 */
#define IPCC_C2MR_CH9OM               IPCC_C2MR_CH9OM_Msk                     /*!< Processor 2 receive channel n occupied interrupt mask */
#define IPCC_C2MR_CH10OM_Pos          (9U)
#define IPCC_C2MR_CH10OM_Msk          (0x1U << IPCC_C2MR_CH10OM_Pos)          /*!< 0x00000200 */
#define IPCC_C2MR_CH10OM              IPCC_C2MR_CH10OM_Msk                    /*!< Processor 2 receive channel n occupied interrupt mask */
#define IPCC_C2MR_CH11OM_Pos          (10U)
#define IPCC_C2MR_CH11OM_Msk          (0x1U << IPCC_C2MR_CH11OM_Pos)          /*!< 0x00000400 */
#define IPCC_C2MR_CH11OM              IPCC_C2MR_CH11OM_Msk                    /*!< Processor 2 receive channel n occupied interrupt mask */
#define IPCC_C2MR_CH12OM_Pos          (11U)
#define IPCC_C2MR_CH12OM_Msk          (0x1U << IPCC_C2MR_CH12OM_Pos)          /*!< 0x00000800 */
#define IPCC_C2MR_CH12OM              IPCC_C2MR_CH12OM_Msk                    /*!< Processor 2 receive channel n occupied interrupt mask */
#define IPCC_C2MR_CH13OM_Pos          (12U)
#define IPCC_C2MR_CH13OM_Msk          (0x1U << IPCC_C2MR_CH13OM_Pos)          /*!< 0x00001000 */
#define IPCC_C2MR_CH13OM              IPCC_C2MR_CH13OM_Msk                    /*!< Processor 2 receive channel n occupied interrupt mask */
#define IPCC_C2MR_CH14OM_Pos          (13U)
#define IPCC_C2MR_CH14OM_Msk          (0x1U << IPCC_C2MR_CH14OM_Pos)          /*!< 0x00002000 */
#define IPCC_C2MR_CH14OM              IPCC_C2MR_CH14OM_Msk                    /*!< Processor 2 receive channel n occupied interrupt mask */
#define IPCC_C2MR_CH15OM_Pos          (14U)
#define IPCC_C2MR_CH15OM_Msk          (0x1U << IPCC_C2MR_CH15OM_Pos)          /*!< 0x00004000 */
#define IPCC_C2MR_CH15OM              IPCC_C2MR_CH15OM_Msk                    /*!< Processor 2 receive channel n occupied interrupt mask */
#define IPCC_C2MR_CH16OM_Pos          (15U)
#define IPCC_C2MR_CH16OM_Msk          (0x1U << IPCC_C2MR_CH16OM_Pos)          /*!< 0x00008000 */
#define IPCC_C2MR_CH16OM              IPCC_C2MR_CH16OM_Msk                    /*!< Processor 2 receive channel n occupied interrupt mask */
#define IPCC_C2MR_CH1FM_Pos           (16U)
#define IPCC_C2MR_CH1FM_Msk           (0x1U << IPCC_C2MR_CH1FM_Pos)           /*!< 0x00010000 */
#define IPCC_C2MR_CH1FM               IPCC_C2MR_CH1FM_Msk                     /*!< Processor 2 Transmit channel n free interrupt mask */
#define IPCC_C2MR_CH2FM_Pos           (17U)
#define IPCC_C2MR_CH2FM_Msk           (0x1U << IPCC_C2MR_CH2FM_Pos)           /*!< 0x00020000 */
#define IPCC_C2MR_CH2FM               IPCC_C2MR_CH2FM_Msk                     /*!< Processor 2 Transmit channel n free interrupt mask */
#define IPCC_C2MR_CH3FM_Pos           (18U)
#define IPCC_C2MR_CH3FM_Msk           (0x1U << IPCC_C2MR_CH3FM_Pos)           /*!< 0x00040000 */
#define IPCC_C2MR_CH3FM               IPCC_C2MR_CH3FM_Msk                     /*!< Processor 2 Transmit channel n free interrupt mask */
#define IPCC_C2MR_CH4FM_Pos           (19U)
#define IPCC_C2MR_CH4FM_Msk           (0x1U << IPCC_C2MR_CH4FM_Pos)           /*!< 0x00080000 */
#define IPCC_C2MR_CH4FM               IPCC_C2MR_CH4FM_Msk                     /*!< Processor 2 Transmit channel n free interrupt mask */
#define IPCC_C2MR_CH5FM_Pos           (20U)
#define IPCC_C2MR_CH5FM_Msk           (0x1U << IPCC_C2MR_CH5FM_Pos)           /*!< 0x00100000 */
#define IPCC_C2MR_CH5FM               IPCC_C2MR_CH5FM_Msk                     /*!< Processor 2 Transmit channel n free interrupt mask */
#define IPCC_C2MR_CH6FM_Pos           (21U)
#define IPCC_C2MR_CH6FM_Msk           (0x1U << IPCC_C2MR_CH6FM_Pos)           /*!< 0x00200000 */
#define IPCC_C2MR_CH6FM               IPCC_C2MR_CH6FM_Msk                     /*!< Processor 2 Transmit channel n free interrupt mask */
#define IPCC_C2MR_CH7FM_Pos           (22U)
#define IPCC_C2MR_CH7FM_Msk           (0x1U << IPCC_C2MR_CH7FM_Pos)           /*!< 0x00400000 */
#define IPCC_C2MR_CH7FM               IPCC_C2MR_CH7FM_Msk                     /*!< Processor 2 Transmit channel n free interrupt mask */
#define IPCC_C2MR_CH8FM_Pos           (23U)
#define IPCC_C2MR_CH8FM_Msk           (0x1U << IPCC_C2MR_CH8FM_Pos)           /*!< 0x00800000 */
#define IPCC_C2MR_CH8FM               IPCC_C2MR_CH8FM_Msk                     /*!< Processor 2 Transmit channel n free interrupt mask */
#define IPCC_C2MR_CH9FM_Pos           (24U)
#define IPCC_C2MR_CH9FM_Msk           (0x1U << IPCC_C2MR_CH9FM_Pos)           /*!< 0x01000000 */
#define IPCC_C2MR_CH9FM               IPCC_C2MR_CH9FM_Msk                     /*!< Processor 2 Transmit channel n free interrupt mask */
#define IPCC_C2MR_CH10FM_Pos          (25U)
#define IPCC_C2MR_CH10FM_Msk          (0x1U << IPCC_C2MR_CH10FM_Pos)          /*!< 0x02000000 */
#define IPCC_C2MR_CH10FM              IPCC_C2MR_CH10FM_Msk                    /*!< Processor 2 Transmit channel n free interrupt mask */
#define IPCC_C2MR_CH11FM_Pos          (26U)
#define IPCC_C2MR_CH11FM_Msk          (0x1U << IPCC_C2MR_CH11FM_Pos)          /*!< 0x04000000 */
#define IPCC_C2MR_CH11FM              IPCC_C2MR_CH11FM_Msk                    /*!< Processor 2 Transmit channel n free interrupt mask */
#define IPCC_C2MR_CH12FM_Pos          (27U)
#define IPCC_C2MR_CH12FM_Msk          (0x1U << IPCC_C2MR_CH12FM_Pos)          /*!< 0x08000000 */
#define IPCC_C2MR_CH12FM              IPCC_C2MR_CH12FM_Msk                    /*!< Processor 2 Transmit channel n free interrupt mask */
#define IPCC_C2MR_CH13FM_Pos          (28U)
#define IPCC_C2MR_CH13FM_Msk          (0x1U << IPCC_C2MR_CH13FM_Pos)          /*!< 0x10000000 */
#define IPCC_C2MR_CH13FM              IPCC_C2MR_CH13FM_Msk                    /*!< Processor 2 Transmit channel n free interrupt mask */
#define IPCC_C2MR_CH14FM_Pos          (29U)
#define IPCC_C2MR_CH14FM_Msk          (0x1U << IPCC_C2MR_CH14FM_Pos)          /*!< 0x20000000 */
#define IPCC_C2MR_CH14FM              IPCC_C2MR_CH14FM_Msk                    /*!< Processor 2 Transmit channel n free interrupt mask */
#define IPCC_C2MR_CH15FM_Pos          (30U)
#define IPCC_C2MR_CH15FM_Msk          (0x1U << IPCC_C2MR_CH15FM_Pos)          /*!< 0x40000000 */
#define IPCC_C2MR_CH15FM              IPCC_C2MR_CH15FM_Msk                    /*!< Processor 2 Transmit channel n free interrupt mask */
#define IPCC_C2MR_CH16FM_Pos          (31U)
#define IPCC_C2MR_CH16FM_Msk          (0x1U << IPCC_C2MR_CH16FM_Pos)          /*!< 0x80000000 */
#define IPCC_C2MR_CH16FM              IPCC_C2MR_CH16FM_Msk                    /*!< Processor 2 Transmit channel n free interrupt mask */

