STMicroelectronics/STM32PRGFW-UTIL/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp257cxx_ca35.h
#define SPI_HWCFGR1_TRGCFG_Pos    (20U)
#define SPI_HWCFGR1_TRGCFG_Msk    (0xFU << SPI_HWCFGR1_TRGCFG_Pos)             /*!< 0x00F00000 */
#define SPI_HWCFGR1_TRGCFG        SPI_HWCFGR1_TRGCFG_Msk                       /*!< Autonomous trigger feature configuration */

#define SPI_HWCFGR1_FULLCFG_Pos   (24U)
#define SPI_HWCFGR1_FULLCFG_Msk   (0xFU << SPI_HWCFGR1_FULLCFG_Pos)            /*!< 0x0F000000 */
#define SPI_HWCFGR1_FULLCFG       SPI_HWCFGR1_FULLCFG_Msk                      /*!< SPI2S full feature version configuration */

/********************  Bits definition for SPI_VERR register     ******************/
#define SPI_VERR_MINREV_Pos      (0U)
#define SPI_VERR_MINREV_Msk      (0xFU << SPI_VERR_MINREV_Pos)               /*!< 0x0000000F */
#define SPI_VERR_MINREV          SPI_VERR_MINREV_Msk                         /*!< Minor Revision of the IP */
#define SPI_VERR_MAJREV_Pos      (4U)
#define SPI_VERR_MAJREV_Msk      (0xFU << SPI_VERR_MAJREV_Pos)               /*!< 0x000000F0 */
#define SPI_VERR_MAJREV          SPI_VERR_MAJREV_Msk                         /*!< Major Revision of the IP */

/********************  Bits definition for SPI_IPIDR register    ******************/
#define SPI_IPIDR_ID_Pos       (0U)
#define SPI_IPIDR_ID_Msk       (0xFFFFFFFFU << SPI_IPIDR_ID_Pos)             /*!< 0xFFFFFFFF */
#define SPI_IPIDR_ID           SPI_IPIDR_ID_Msk                              /*!< MCD identification code which identifies the IP */
/********************  Bits definition for SPI_SIDR register     ******************/
#define SPI_SIDR_SID_Pos         (0U)
#define SPI_SIDR_SID_Msk         (0xFFFFFFFFU << SPI_SIDR_SID_Pos)           /*!< 0xFFFFFFFF */
#define SPI_SIDR_SID             SPI_SIDR_SID_Msk                            /*!< Size identification */

/******************************************************************************/
/*                                                                            */
/*                 System configuration controller (SYSCFG)                   */
/*                                                                            */
/******************************************************************************/
/****************  Bit definition for SYSCFG_BOOTSR register  *****************/
#define SYSCFG_BOOTSR_BOOT0_Pos                                            (0U)
#define SYSCFG_BOOTSR_BOOT0_Msk                                            (0x1U << SYSCFG_BOOTSR_BOOT0_Pos)                                              /*!< 0x00000001 */
#define SYSCFG_BOOTSR_BOOT0                                                SYSCFG_BOOTSR_BOOT0_Msk                                                        /*!< BOOT0 pin value */
#define SYSCFG_BOOTSR_BOOT1_Pos                                            (1U)
#define SYSCFG_BOOTSR_BOOT1_Msk                                            (0x1U << SYSCFG_BOOTSR_BOOT1_Pos)                                              /*!< 0x00000002 */
#define SYSCFG_BOOTSR_BOOT1                                                SYSCFG_BOOTSR_BOOT1_Msk                                                        /*!< BOOT1 pin value */
#define SYSCFG_BOOTSR_BOOT2_Pos                                            (2U)
#define SYSCFG_BOOTSR_BOOT2_Msk                                            (0x1U << SYSCFG_BOOTSR_BOOT2_Pos)                                              /*!< 0x00000004 */
#define SYSCFG_BOOTSR_BOOT2                                                SYSCFG_BOOTSR_BOOT2_Msk                                                        /*!< BOOT2 pin value */
#define SYSCFG_BOOTSR_BOOT3_Pos                                            (3U)
#define SYSCFG_BOOTSR_BOOT3_Msk                                            (0x1U << SYSCFG_BOOTSR_BOOT3_Pos)                                              /*!< 0x00000008 */
#define SYSCFG_BOOTSR_BOOT3                                                SYSCFG_BOOTSR_BOOT3_Msk                                                        /*!< BOOT3 pin value */

/****************  Bit definition for SYSCFG_BOOTCR register  *****************/
#define SYSCFG_BOOTCR_BOOT0_PD_Pos                                         (0U)
#define SYSCFG_BOOTCR_BOOT0_PD_Msk                                         (0x1U << SYSCFG_BOOTCR_BOOT0_PD_Pos)                                           /*!< 0x00000001 */
#define SYSCFG_BOOTCR_BOOT0_PD                                             SYSCFG_BOOTCR_BOOT0_PD_Msk                                                     /*!< BOOT0 pin pull-down disable */
#define SYSCFG_BOOTCR_BOOT1_PD_Pos                                         (1U)
#define SYSCFG_BOOTCR_BOOT1_PD_Msk                                         (0x1U << SYSCFG_BOOTCR_BOOT1_PD_Pos)                                           /*!< 0x00000002 */
#define SYSCFG_BOOTCR_BOOT1_PD                                             SYSCFG_BOOTCR_BOOT1_PD_Msk                                                     /*!< BOOT1 pin pull-down disable */
#define SYSCFG_BOOTCR_BOOT2_PD_Pos                                         (2U)
#define SYSCFG_BOOTCR_BOOT2_PD_Msk                                         (0x1U << SYSCFG_BOOTCR_BOOT2_PD_Pos)                                           /*!< 0x00000004 */
#define SYSCFG_BOOTCR_BOOT2_PD                                             SYSCFG_BOOTCR_BOOT2_PD_Msk                                                     /*!< BOOT2 pin pull-down disable */
#define SYSCFG_BOOTCR_BOOT3_PD_Pos                                         (3U)
#define SYSCFG_BOOTCR_BOOT3_PD_Msk                                         (0x1U << SYSCFG_BOOTCR_BOOT3_PD_Pos)                                           /*!< 0x00000008 */
#define SYSCFG_BOOTCR_BOOT3_PD                                             SYSCFG_BOOTCR_BOOT3_PD_Msk                                                     /*!< BOOT3 pin pull-down disable */

/***************  Bit definition for SYSCFG_DLYBSD1CR register  ***************/
#define SYSCFG_DLYBSD1CR_EN_Pos                                            (0U)
#define SYSCFG_DLYBSD1CR_EN_Msk                                            (0x1U << SYSCFG_DLYBSD1CR_EN_Pos)                                              /*!< 0x00000001 */
#define SYSCFG_DLYBSD1CR_EN                                                SYSCFG_DLYBSD1CR_EN_Msk                                                        /*!< When 1, DLL is enabled */
#define SYSCFG_DLYBSD1CR_RX_TAP_SEL_Pos                                    (1U)
#define SYSCFG_DLYBSD1CR_RX_TAP_SEL_Msk                                    (0x3FU << SYSCFG_DLYBSD1CR_RX_TAP_SEL_Pos)                                     /*!< 0x0000007E */
#define SYSCFG_DLYBSD1CR_RX_TAP_SEL                                        SYSCFG_DLYBSD1CR_RX_TAP_SEL_Msk                                                /*!< selection of TAP number for RX clock */
#define SYSCFG_DLYBSD1CR_BYP_EN_Pos                                        (16U)
#define SYSCFG_DLYBSD1CR_BYP_EN_Msk                                        (0x1U << SYSCFG_DLYBSD1CR_BYP_EN_Pos)                                          /*!< 0x00010000 */
#define SYSCFG_DLYBSD1CR_BYP_EN                                            SYSCFG_DLYBSD1CR_BYP_EN_Msk                                                    /*!< When 1, DLL bypass mode is enabled */
#define SYSCFG_DLYBSD1CR_BYP_CMD_Pos                                       (17U)
#define SYSCFG_DLYBSD1CR_BYP_CMD_Msk                                       (0x1FU << SYSCFG_DLYBSD1CR_BYP_CMD_Pos)                                        /*!< 0x003E0000 */
#define SYSCFG_DLYBSD1CR_BYP_CMD                                           SYSCFG_DLYBSD1CR_BYP_CMD_Msk                                                   /*!< value of the delay unit when in DLL bypass mode */
#define SYSCFG_DLYBSD1CR_ANTIGLITCH_EN_Pos                                 (22U)
#define SYSCFG_DLYBSD1CR_ANTIGLITCH_EN_Msk                                 (0x1U << SYSCFG_DLYBSD1CR_ANTIGLITCH_EN_Pos)                                   /*!< 0x00400000 */
#define SYSCFG_DLYBSD1CR_ANTIGLITCH_EN                                     SYSCFG_DLYBSD1CR_ANTIGLITCH_EN_Msk                                             /*!< When 1, the anti-glitch logic is enabled */

