STMicroelectronics/STM32PRGFW-UTIL/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp257cxx_ca35.h
/****************  Bit definition for USART_HWCFGR2 register  *****************/
#define USART_HWCFGR2_CFG1_Pos         (0U)
#define USART_HWCFGR2_CFG1_Msk         (0xFU << USART_HWCFGR2_CFG1_Pos)    /*!< 0x0000000F */
#define USART_HWCFGR2_CFG1             USART_HWCFGR2_CFG1_Msk      /*!< USART hardware configuration 1 */
#define USART_HWCFGR2_CFG2_Pos         (4U)
#define USART_HWCFGR2_CFG2_Msk         (0xFU << USART_HWCFGR2_CFG2_Pos)    /*!< 0x000000F0 */
#define USART_HWCFGR2_CFG2             USART_HWCFGR2_CFG2_Msk      /*!< USART hardware configuration 2 */
#define USART_HWCFGR2_CFG3_Pos         (8U)
#define USART_HWCFGR2_CFG3_Msk         (0xFU << USART_HWCFGR2_CFG3_Pos)    /*!< 0x00000F00 */
#define USART_HWCFGR2_CFG3             USART_HWCFGR2_CFG3_Msk      /*!< USART hardware configuration 3 */

/****************  Bit definition for USART_HWCFGR1 register  *****************/
#define USART_HWCFGR1_CFG1_Pos         (0U)
#define USART_HWCFGR1_CFG1_Msk         (0xFU << USART_HWCFGR1_CFG1_Pos)    /*!< 0x0000000F */
#define USART_HWCFGR1_CFG1             USART_HWCFGR1_CFG1_Msk      /*!< USART hardware configuration 1 */
#define USART_HWCFGR1_CFG2_Pos         (4U)
#define USART_HWCFGR1_CFG2_Msk         (0xFU << USART_HWCFGR1_CFG2_Pos)    /*!< 0x000000F0 */
#define USART_HWCFGR1_CFG2             USART_HWCFGR1_CFG2_Msk      /*!< USART hardware configuration 2 */
#define USART_HWCFGR1_CFG3_Pos         (8U)
#define USART_HWCFGR1_CFG3_Msk         (0xFU << USART_HWCFGR1_CFG3_Pos)    /*!< 0x00000F00 */
#define USART_HWCFGR1_CFG3             USART_HWCFGR1_CFG3_Msk      /*!< USART hardware configuration 3 */
#define USART_HWCFGR1_CFG4_Pos         (12U)
#define USART_HWCFGR1_CFG4_Msk         (0xFU << USART_HWCFGR1_CFG4_Pos)    /*!< 0x0000F000 */
#define USART_HWCFGR1_CFG4             USART_HWCFGR1_CFG4_Msk      /*!< USART hardware configuration 4 */
#define USART_HWCFGR1_CFG5_Pos         (16U)
#define USART_HWCFGR1_CFG5_Msk         (0xFU << USART_HWCFGR1_CFG5_Pos)    /*!< 0x000F0000 */
#define USART_HWCFGR1_CFG5             USART_HWCFGR1_CFG5_Msk      /*!< USART hardware configuration 5 */
#define USART_HWCFGR1_CFG6_Pos         (20U)
#define USART_HWCFGR1_CFG6_Msk         (0xFU << USART_HWCFGR1_CFG6_Pos)    /*!< 0x00F00000 */
#define USART_HWCFGR1_CFG6             USART_HWCFGR1_CFG6_Msk      /*!< USART hardware configuration 6 */
#define USART_HWCFGR1_CFG7_Pos         (24U)
#define USART_HWCFGR1_CFG7_Msk         (0xFU << USART_HWCFGR1_CFG7_Pos)    /*!< 0x0F000000 */
#define USART_HWCFGR1_CFG7             USART_HWCFGR1_CFG7_Msk      /*!< USART hardware configuration 7 */
#define USART_HWCFGR1_CFG8_Pos         (28U)
#define USART_HWCFGR1_CFG8_Msk         (0xFU << USART_HWCFGR1_CFG8_Pos)    /*!< 0xF0000000 */
#define USART_HWCFGR1_CFG8             USART_HWCFGR1_CFG8_Msk      /*!< USART hardware configuration 8  */

/******************  Bit definition for USART_VERR register  ******************/
#define USART_VERR_MINREV_Pos          (0U)
#define USART_VERR_MINREV_Msk          (0xFU << USART_VERR_MINREV_Pos)   /*!< 0x0000000F */
#define USART_VERR_MINREV              USART_VERR_MINREV_Msk       /*!< Minor revision */
#define USART_VERR_MAJREV_Pos          (4U)
#define USART_VERR_MAJREV_Msk          (0xFU << USART_VERR_MAJREV_Pos)   /*!< 0x000000F0 */
#define USART_VERR_MAJREV              USART_VERR_MAJREV_Msk       /*!< Major revision */

/*****************  Bit definition for USART_IPIDR register  ******************/
#define USART_IPIDR_ID_Pos             (0U)
#define USART_IPIDR_ID_Msk             (0xFFFFFFFFU << USART_IPIDR_ID_Pos)       /*!< 0xFFFFFFFF */
#define USART_IPIDR_ID                 USART_IPIDR_ID_Msk          /*!< Peripheral identifier */

/******************  Bit definition for USART_SIDR register  ******************/
#define USART_SIDR_SID_Pos             (0U)
#define USART_SIDR_SID_Msk             (0xFFFFFFFFU << USART_SIDR_SID_Pos)       /*!< 0xFFFFFFFF */
#define USART_SIDR_SID                 USART_SIDR_SID_Msk          /*!< Size identification  */

/******************************************************************************/
/*                                                                            */
/*                                USB_DWC3 (USB3)                                 */
/*                                                                            */
/******************************************************************************/

/* Bit fields for USB3_GSBUSCFG0 register */
#define USB3_GSBUSCFG0_INCRBRSTENA_Pos                           0
#define USB3_GSBUSCFG0_INCRBRSTENA_Msk                           (0x1UL << 0)
#define USB3_GSBUSCFG0_INCRBRSTENA                               (0x1UL << 0)
#define USB3_GSBUSCFG0_INCR4BRSTENA_Pos                          1
#define USB3_GSBUSCFG0_INCR4BRSTENA_Msk                          (0x1UL << 1)
#define USB3_GSBUSCFG0_INCR4BRSTENA                              (0x1UL << 1)
#define USB3_GSBUSCFG0_INCR8BRSTENA_Pos                          2
#define USB3_GSBUSCFG0_INCR8BRSTENA_Msk                          (0x1UL << 2)
#define USB3_GSBUSCFG0_INCR8BRSTENA                              (0x1UL << 2)
#define USB3_GSBUSCFG0_INCR16BRSTENA_Pos                         3
#define USB3_GSBUSCFG0_INCR16BRSTENA_Msk                         (0x1UL << 3)
#define USB3_GSBUSCFG0_INCR16BRSTENA                             (0x1UL << 3)
#define USB3_GSBUSCFG0_INCR32BRSTENA_Pos                         4
#define USB3_GSBUSCFG0_INCR32BRSTENA_Msk                         (0x1UL << 4)
#define USB3_GSBUSCFG0_INCR32BRSTENA                             (0x1UL << 4)
#define USB3_GSBUSCFG0_INCR64BRSTENA_Pos                         5
#define USB3_GSBUSCFG0_INCR64BRSTENA_Msk                         (0x1UL << 5)
#define USB3_GSBUSCFG0_INCR64BRSTENA                             (0x1UL << 5)
#define USB3_GSBUSCFG0_INCR128BRSTENA_Pos                        6
#define USB3_GSBUSCFG0_INCR128BRSTENA_Msk                        (0x1UL << 6)
#define USB3_GSBUSCFG0_INCR128BRSTENA                            (0x1UL << 6)
#define USB3_GSBUSCFG0_INCR256BRSTENA_Pos                        7
#define USB3_GSBUSCFG0_INCR256BRSTENA_Msk                        (0x1UL << 7)
#define USB3_GSBUSCFG0_INCR256BRSTENA                            (0x1UL << 7)
#define USB3_GSBUSCFG0_DESBIGEND_Pos                             10
#define USB3_GSBUSCFG0_DESBIGEND_Msk                             (0x1UL << 10)
#define USB3_GSBUSCFG0_DESBIGEND                                 (0x1UL << 10)
#define USB3_GSBUSCFG0_DATBIGEND_Pos                             11
#define USB3_GSBUSCFG0_DATBIGEND_Msk                             (0x1UL << 11)
#define USB3_GSBUSCFG0_DATBIGEND                                 (0x1UL << 11)
#define USB3_GSBUSCFG0_DESWRREQINFO_Pos                          16
#define USB3_GSBUSCFG0_DESWRREQINFO_Msk                          (0xfUL << 16)
#define USB3_GSBUSCFG0_DESWRREQINFO                              (0xfUL << 16)
#define USB3_GSBUSCFG0_DATWRREQINFO_Pos                          20
#define USB3_GSBUSCFG0_DATWRREQINFO_Msk                          (0xfUL << 20)
#define USB3_GSBUSCFG0_DATWRREQINFO                              (0xfUL << 20)
#define USB3_GSBUSCFG0_DESRDREQINFO_Pos                          24
#define USB3_GSBUSCFG0_DESRDREQINFO_Msk                          (0xfUL << 24)
#define USB3_GSBUSCFG0_DESRDREQINFO                              (0xfUL << 24)
#define USB3_GSBUSCFG0_DATRDREQINFO_Pos                          28
#define USB3_GSBUSCFG0_DATRDREQINFO_Msk                          (0xfUL << 28)
#define USB3_GSBUSCFG0_DATRDREQINFO                              (0xfUL << 28)

/* Bit fields for USB3_GSBUSCFG1 register */
#define USB3_GSBUSCFG1_PipeTransLimit_Pos                        8
#define USB3_GSBUSCFG1_PipeTransLimit_Msk                        (0xfUL << 8)
#define USB3_GSBUSCFG1_PipeTransLimit                            (0xfUL << 8)
#define USB3_GSBUSCFG1_EN1KPAGE_Pos                              12
#define USB3_GSBUSCFG1_EN1KPAGE_Msk                              (0x1UL << 12)
#define USB3_GSBUSCFG1_EN1KPAGE                                  (0x1UL << 12)

/* Bit fields for USB3_GTXTHRCFG register */
#define USB3_GTXTHRCFG_UsbMaxTxBurstSize_Pos                     16
#define USB3_GTXTHRCFG_UsbMaxTxBurstSize_Msk                     (0xffUL << 16)
#define USB3_GTXTHRCFG_UsbMaxTxBurstSize                         (0xffUL << 16)
#define USB3_GTXTHRCFG_UsbTxPktCnt_Pos                           24
#define USB3_GTXTHRCFG_UsbTxPktCnt_Msk                           (0xfUL << 24)
#define USB3_GTXTHRCFG_UsbTxPktCnt                               (0xfUL << 24)
#define USB3_GTXTHRCFG_UsbTxPktCntSel_Pos                        29
#define USB3_GTXTHRCFG_UsbTxPktCntSel_Msk                        (0x1UL << 29)
#define USB3_GTXTHRCFG_UsbTxPktCntSel                            (0x1UL << 29)

