STMicroelectronics/STM32PRGFW-UTIL/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp257cxx_ca35.h
/* Bit fields for USB3_GSNPSID register */
#define USB3_GSNPSID_SYNOPSYSID_Pos                              0
#define USB3_GSNPSID_SYNOPSYSID_Msk                              (0xFFFFFFFFUL << 0)
#define USB3_GSNPSID_SYNOPSYSID                                  (0xFFFFFFFFUL << 0)

/* Bit fields for USB3_GGPIO register */
#define USB3_GGPIO_GPI_Pos                                       0
#define USB3_GGPIO_GPI_Msk                                       (0xffffUL << 0)
#define USB3_GGPIO_GPI                                           (0xffffUL << 0)
#define USB3_GGPIO_GPO_Pos                                       16
#define USB3_GGPIO_GPO_Msk                                       (0xffffUL << 16)
#define USB3_GGPIO_GPO                                           (0xffffUL << 16)

/* Bit fields for USB3_GUID register */
#define USB3_GUID_USERID_Pos                                     0
#define USB3_GUID_USERID_Msk                                     (0xFFFFFFFFUL << 0)
#define USB3_GUID_USERID                                         (0xFFFFFFFFUL << 0)

/* Bit fields for USB3_GUCTL register */
#define USB3_GUCTL_DTFT_Pos                                      0
#define USB3_GUCTL_DTFT_Msk                                      (0x1ffUL << 0)
#define USB3_GUCTL_DTFT                                          (0x1ffUL << 0)
#define USB3_GUCTL_DTCT_Pos                                      9
#define USB3_GUCTL_DTCT_Msk                                      (0x3UL << 9)
#define USB3_GUCTL_DTCT                                          (0x3UL << 9)
#define USB3_GUCTL_InsrtExtrFSBODI_Pos                           11
#define USB3_GUCTL_InsrtExtrFSBODI_Msk                           (0x1UL << 11)
#define USB3_GUCTL_InsrtExtrFSBODI                               (0x1UL << 11)
#define USB3_GUCTL_ExtCapSupptEN_Pos                             12
#define USB3_GUCTL_ExtCapSupptEN_Msk                             (0x1UL << 12)
#define USB3_GUCTL_ExtCapSupptEN                                 (0x1UL << 12)
#define USB3_GUCTL_EnOverlapChk_Pos                              13
#define USB3_GUCTL_EnOverlapChk_Msk                              (0x1UL << 13)
#define USB3_GUCTL_EnOverlapChk                                  (0x1UL << 13)
#define USB3_GUCTL_USBHstInAutoRetryEn_Pos                       14
#define USB3_GUCTL_USBHstInAutoRetryEn_Msk                       (0x1UL << 14)
#define USB3_GUCTL_USBHstInAutoRetryEn                           (0x1UL << 14)
#define USB3_GUCTL_ResBwHSEPS_Pos                                16
#define USB3_GUCTL_ResBwHSEPS_Msk                                (0x1UL << 16)
#define USB3_GUCTL_ResBwHSEPS                                    (0x1UL << 16)
#define USB3_GUCTL_SprsCtrlTransEn_Pos                           17
#define USB3_GUCTL_SprsCtrlTransEn_Msk                           (0x1UL << 17)
#define USB3_GUCTL_SprsCtrlTransEn                               (0x1UL << 17)
#define USB3_GUCTL_NoExtrDl_Pos                                  21
#define USB3_GUCTL_NoExtrDl_Msk                                  (0x1UL << 21)
#define USB3_GUCTL_NoExtrDl                                      (0x1UL << 21)
#define USB3_GUCTL_REFCLKPER_Pos                                 22
#define USB3_GUCTL_REFCLKPER_Msk                                 (0x3ffUL << 22)
#define USB3_GUCTL_REFCLKPER                                     (0x3ffUL << 22)

/* Bit fields for USB3_GBUSERRADDRLO register */
#define USB3_GBUSERRADDRLO_BUSERRADDR_Pos                        0
#define USB3_GBUSERRADDRLO_BUSERRADDR_Msk                        (0xFFFFFFFFUL << 0)
#define USB3_GBUSERRADDRLO_BUSERRADDR                            (0xFFFFFFFFUL << 0)

/* Bit fields for USB3_GBUSERRADDRHI register */
#define USB3_GBUSERRADDRHI_BUSERRADDR_Pos                        0
#define USB3_GBUSERRADDRHI_BUSERRADDR_Msk                        (0xFFFFFFFFUL << 0)
#define USB3_GBUSERRADDRHI_BUSERRADDR                            (0xFFFFFFFFUL << 0)

/* Bit fields for USB3_GPRTBIMAPLO register */
#define USB3_GPRTBIMAPLO_BINUM1_Pos                              0
#define USB3_GPRTBIMAPLO_BINUM1_Msk                              (0xfUL << 0)
#define USB3_GPRTBIMAPLO_BINUM1                                  (0xfUL << 0)
#define USB3_GPRTBIMAPLO_BINUM2_Pos                              4
#define USB3_GPRTBIMAPLO_BINUM2_Msk                              (0xfUL << 4)
#define USB3_GPRTBIMAPLO_BINUM2                                  (0xfUL << 4)
#define USB3_GPRTBIMAPLO_BINUM3_Pos                              8
#define USB3_GPRTBIMAPLO_BINUM3_Msk                              (0xfUL << 8)
#define USB3_GPRTBIMAPLO_BINUM3                                  (0xfUL << 8)
#define USB3_GPRTBIMAPLO_BINUM4_Pos                              12
#define USB3_GPRTBIMAPLO_BINUM4_Msk                              (0xfUL << 12)
#define USB3_GPRTBIMAPLO_BINUM4                                  (0xfUL << 12)
#define USB3_GPRTBIMAPLO_BINUM5_Pos                              16
#define USB3_GPRTBIMAPLO_BINUM5_Msk                              (0xfUL << 16)
#define USB3_GPRTBIMAPLO_BINUM5                                  (0xfUL << 16)
#define USB3_GPRTBIMAPLO_BINUM6_Pos                              20
#define USB3_GPRTBIMAPLO_BINUM6_Msk                              (0xfUL << 20)
#define USB3_GPRTBIMAPLO_BINUM6                                  (0xfUL << 20)
#define USB3_GPRTBIMAPLO_BINUM7_Pos                              24
#define USB3_GPRTBIMAPLO_BINUM7_Msk                              (0xfUL << 24)
#define USB3_GPRTBIMAPLO_BINUM7                                  (0xfUL << 24)
#define USB3_GPRTBIMAPLO_BINUM8_Pos                              28
#define USB3_GPRTBIMAPLO_BINUM8_Msk                              (0xfUL << 28)
#define USB3_GPRTBIMAPLO_BINUM8                                  (0xfUL << 28)

/* Bit fields for USB3_GPRTBIMAPHI register */
#define USB3_GPRTBIMAPHI_BINUM9_Pos                              0
#define USB3_GPRTBIMAPHI_BINUM9_Msk                              (0xfUL << 0)
#define USB3_GPRTBIMAPHI_BINUM9                                  (0xfUL << 0)
#define USB3_GPRTBIMAPHI_BINUM10_Pos                             4
#define USB3_GPRTBIMAPHI_BINUM10_Msk                             (0xfUL << 4)
#define USB3_GPRTBIMAPHI_BINUM10                                 (0xfUL << 4)
#define USB3_GPRTBIMAPHI_BINUM11_Pos                             8
#define USB3_GPRTBIMAPHI_BINUM11_Msk                             (0xfUL << 8)
#define USB3_GPRTBIMAPHI_BINUM11                                 (0xfUL << 8)
#define USB3_GPRTBIMAPHI_BINUM12_Pos                             12
#define USB3_GPRTBIMAPHI_BINUM12_Msk                             (0xfUL << 12)
#define USB3_GPRTBIMAPHI_BINUM12                                 (0xfUL << 12)
#define USB3_GPRTBIMAPHI_BINUM13_Pos                             16
#define USB3_GPRTBIMAPHI_BINUM13_Msk                             (0xfUL << 16)
#define USB3_GPRTBIMAPHI_BINUM13                                 (0xfUL << 16)
#define USB3_GPRTBIMAPHI_BINUM14_Pos                             20
#define USB3_GPRTBIMAPHI_BINUM14_Msk                             (0xfUL << 20)
#define USB3_GPRTBIMAPHI_BINUM14                                 (0xfUL << 20)
#define USB3_GPRTBIMAPHI_BINUM15_Pos                             24
#define USB3_GPRTBIMAPHI_BINUM15_Msk                             (0xfUL << 24)
#define USB3_GPRTBIMAPHI_BINUM15                                 (0xfUL << 24)

/* Bit fields for USB3_GHWPARAMS0 register */
#define USB3_GHWPARAMS0_ghwparams0_2_0_Pos                       0
#define USB3_GHWPARAMS0_ghwparams0_2_0_Msk                       (0x7UL << 0)
#define USB3_GHWPARAMS0_ghwparams0_2_0                           (0x7UL << 0)
#define USB3_GHWPARAMS0_ghwparams0_5_3_Pos                       3
#define USB3_GHWPARAMS0_ghwparams0_5_3_Msk                       (0x7UL << 3)
#define USB3_GHWPARAMS0_ghwparams0_5_3                           (0x7UL << 3)
#define USB3_GHWPARAMS0_ghwparams0_7_6_Pos                       6
#define USB3_GHWPARAMS0_ghwparams0_7_6_Msk                       (0x3UL << 6)
#define USB3_GHWPARAMS0_ghwparams0_7_6                           (0x3UL << 6)
#define USB3_GHWPARAMS0_ghwparams0_15_8_Pos                      8
#define USB3_GHWPARAMS0_ghwparams0_15_8_Msk                      (0xffUL << 8)
#define USB3_GHWPARAMS0_ghwparams0_15_8                          (0xffUL << 8)
#define USB3_GHWPARAMS0_ghwparams0_23_16_Pos                     16
#define USB3_GHWPARAMS0_ghwparams0_23_16_Msk                     (0xffUL << 16)
#define USB3_GHWPARAMS0_ghwparams0_23_16                         (0xffUL << 16)
#define USB3_GHWPARAMS0_ghwparams0_31_24_Pos                     24
#define USB3_GHWPARAMS0_ghwparams0_31_24_Msk                     (0xffUL << 24)
#define USB3_GHWPARAMS0_ghwparams0_31_24                         (0xffUL << 24)

/* Bit fields for USB3_GHWPARAMS1 register */
#define USB3_GHWPARAMS1_ghwparams1_2_0_Pos                       0
#define USB3_GHWPARAMS1_ghwparams1_2_0_Msk                       (0x7UL << 0)
#define USB3_GHWPARAMS1_ghwparams1_2_0                           (0x7UL << 0)
#define USB3_GHWPARAMS1_ghwparams1_5_3_Pos                       3
#define USB3_GHWPARAMS1_ghwparams1_5_3_Msk                       (0x7UL << 3)
#define USB3_GHWPARAMS1_ghwparams1_5_3                           (0x7UL << 3)
#define USB3_GHWPARAMS1_ghwparams1_8_6_Pos                       6
#define USB3_GHWPARAMS1_ghwparams1_8_6_Msk                       (0x7UL << 6)
#define USB3_GHWPARAMS1_ghwparams1_8_6                           (0x7UL << 6)
#define USB3_GHWPARAMS1_ghwparams1_11_9_Pos                      9
#define USB3_GHWPARAMS1_ghwparams1_11_9_Msk                      (0x7UL << 9)
#define USB3_GHWPARAMS1_ghwparams1_11_9                          (0x7UL << 9)
#define USB3_GHWPARAMS1_ghwparams1_14_12_Pos                     12
#define USB3_GHWPARAMS1_ghwparams1_14_12_Msk                     (0x7UL << 12)
#define USB3_GHWPARAMS1_ghwparams1_14_12                         (0x7UL << 12)
#define USB3_GHWPARAMS1_ghwparams1_20_15_Pos                     15
#define USB3_GHWPARAMS1_ghwparams1_20_15_Msk                     (0x3fUL << 15)
#define USB3_GHWPARAMS1_ghwparams1_20_15                         (0x3fUL << 15)
#define USB3_GHWPARAMS1_ghwparams1_22_21_Pos                     21
#define USB3_GHWPARAMS1_ghwparams1_22_21_Msk                     (0x3UL << 21)
#define USB3_GHWPARAMS1_ghwparams1_22_21                         (0x3UL << 21)
#define USB3_GHWPARAMS1_ghwparams1_23_Pos                        23
#define USB3_GHWPARAMS1_ghwparams1_23_Msk                        (0x1UL << 23)
#define USB3_GHWPARAMS1_ghwparams1_23                            (0x1UL << 23)
#define USB3_GHWPARAMS1_ghwparams1_25_24_Pos                     24
#define USB3_GHWPARAMS1_ghwparams1_25_24_Msk                     (0x3UL << 24)
#define USB3_GHWPARAMS1_ghwparams1_25_24                         (0x3UL << 24)
#define USB3_GHWPARAMS1_ghwparams1_26_Pos                        26
#define USB3_GHWPARAMS1_ghwparams1_26_Msk                        (0x1UL << 26)
#define USB3_GHWPARAMS1_ghwparams1_26                            (0x1UL << 26)
#define USB3_GHWPARAMS1_ghwparams1_27_Pos                        27
#define USB3_GHWPARAMS1_ghwparams1_27_Msk                        (0x1UL << 27)
#define USB3_GHWPARAMS1_ghwparams1_27                            (0x1UL << 27)
#define USB3_GHWPARAMS1_ghwparams1_28_Pos                        28
#define USB3_GHWPARAMS1_ghwparams1_28_Msk                        (0x1UL << 28)
#define USB3_GHWPARAMS1_ghwparams1_28                            (0x1UL << 28)
#define USB3_GHWPARAMS1_ghwparams1_29_Pos                        29
#define USB3_GHWPARAMS1_ghwparams1_29_Msk                        (0x1UL << 29)
#define USB3_GHWPARAMS1_ghwparams1_29                            (0x1UL << 29)
#define USB3_GHWPARAMS1_ghwparams1_30_Pos                        30
#define USB3_GHWPARAMS1_ghwparams1_30_Msk                        (0x1UL << 30)
#define USB3_GHWPARAMS1_ghwparams1_30                            (0x1UL << 30)
#define USB3_GHWPARAMS1_ghwparams1_31_Pos                        31
#define USB3_GHWPARAMS1_ghwparams1_31_Msk                        (0x1UL << 31)
#define USB3_GHWPARAMS1_ghwparams1_31                            (0x1UL << 31)

