STMicroelectronics/STM32PRGFW-UTIL/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp257cxx_ca35.h
/* Bit fields for USB3_GUSB2I2CCTL register */

/* Bit fields for USB3_GUSB2PHYACC_ULPI register */
#define USB3_GUSB2PHYACC_ULPI_REGDATA_Pos                        0
#define USB3_GUSB2PHYACC_ULPI_REGDATA_Msk                        (0xffUL << 0)
#define USB3_GUSB2PHYACC_ULPI_REGDATA                            (0xffUL << 0)
#define USB3_GUSB2PHYACC_ULPI_EXTREGADDR_Pos                     8
#define USB3_GUSB2PHYACC_ULPI_EXTREGADDR_Msk                     (0xffUL << 8)
#define USB3_GUSB2PHYACC_ULPI_EXTREGADDR                         (0xffUL << 8)
#define USB3_GUSB2PHYACC_ULPI_REGADDR_Pos                        16
#define USB3_GUSB2PHYACC_ULPI_REGADDR_Msk                        (0x3fUL << 16)
#define USB3_GUSB2PHYACC_ULPI_REGADDR                            (0x3fUL << 16)
#define USB3_GUSB2PHYACC_ULPI_REGWR_Pos                          22
#define USB3_GUSB2PHYACC_ULPI_REGWR_Msk                          (0x1UL << 22)
#define USB3_GUSB2PHYACC_ULPI_REGWR                              (0x1UL << 22)
#define USB3_GUSB2PHYACC_ULPI_VSTSBSY_Pos                        23
#define USB3_GUSB2PHYACC_ULPI_VSTSBSY_Msk                        (0x1UL << 23)
#define USB3_GUSB2PHYACC_ULPI_VSTSBSY                            (0x1UL << 23)
#define USB3_GUSB2PHYACC_ULPI_VSTSDONE_Pos                       24
#define USB3_GUSB2PHYACC_ULPI_VSTSDONE_Msk                       (0x1UL << 24)
#define USB3_GUSB2PHYACC_ULPI_VSTSDONE                           (0x1UL << 24)
#define USB3_GUSB2PHYACC_ULPI_NEWREGREQ_Pos                      25
#define USB3_GUSB2PHYACC_ULPI_NEWREGREQ_Msk                      (0x1UL << 25)
#define USB3_GUSB2PHYACC_ULPI_NEWREGREQ                          (0x1UL << 25)
#define USB3_GUSB2PHYACC_ULPI_DISUIPIDRVR_Pos                    26
#define USB3_GUSB2PHYACC_ULPI_DISUIPIDRVR_Msk                    (0x1UL << 26)
#define USB3_GUSB2PHYACC_ULPI_DISUIPIDRVR                        (0x1UL << 26)

/* Bit fields for USB3_GUSB3PIPECTL register */
#define USB3_GUSB3PIPECTL_ELASTIC_BUFFER_MODE_Pos                0
#define USB3_GUSB3PIPECTL_ELASTIC_BUFFER_MODE_Msk                (0x1UL << 0)
#define USB3_GUSB3PIPECTL_ELASTIC_BUFFER_MODE                    (0x1UL << 0)
#define USB3_GUSB3PIPECTL_SS_TX_DE_EMPHASIS_Pos                  1
#define USB3_GUSB3PIPECTL_SS_TX_DE_EMPHASIS_Msk                  (0x3UL << 1)
#define USB3_GUSB3PIPECTL_SS_TX_DE_EMPHASIS                      (0x3UL << 1)
#define USB3_GUSB3PIPECTL_TX_MARGIN_Pos                          3
#define USB3_GUSB3PIPECTL_TX_MARGIN_Msk                          (0x7UL << 3)
#define USB3_GUSB3PIPECTL_TX_MARGIN                              (0x7UL << 3)
#define USB3_GUSB3PIPECTL_TX_SWING_Pos                           6
#define USB3_GUSB3PIPECTL_TX_SWING_Msk                           (0x1UL << 6)
#define USB3_GUSB3PIPECTL_TX_SWING                               (0x1UL << 6)
#define USB3_GUSB3PIPECTL_SSICEn_Pos                             7
#define USB3_GUSB3PIPECTL_SSICEn_Msk                             (0x1UL << 7)
#define USB3_GUSB3PIPECTL_SSICEn                                 (0x1UL << 7)
#define USB3_GUSB3PIPECTL_RX_DETECT_to_Polling_LFPS_Control_Pos  8
#define USB3_GUSB3PIPECTL_RX_DETECT_to_Polling_LFPS_Control_Msk  (0x1UL << 8)
#define USB3_GUSB3PIPECTL_RX_DETECT_to_Polling_LFPS_Control      (0x1UL << 8)
#define USB3_GUSB3PIPECTL_LFPSFILTER_Pos                         9
#define USB3_GUSB3PIPECTL_LFPSFILTER_Msk                         (0x1UL << 9)
#define USB3_GUSB3PIPECTL_LFPSFILTER                             (0x1UL << 9)
#define USB3_GUSB3PIPECTL_P3ExSigP2_Pos                          10
#define USB3_GUSB3PIPECTL_P3ExSigP2_Msk                          (0x1UL << 10)
#define USB3_GUSB3PIPECTL_P3ExSigP2                              (0x1UL << 10)
#define USB3_GUSB3PIPECTL_P3P2TranOK_Pos                         11
#define USB3_GUSB3PIPECTL_P3P2TranOK_Msk                         (0x1UL << 11)
#define USB3_GUSB3PIPECTL_P3P2TranOK                             (0x1UL << 11)
#define USB3_GUSB3PIPECTL_LFPSP0Algn_Pos                         12
#define USB3_GUSB3PIPECTL_LFPSP0Algn_Msk                         (0x1UL << 12)
#define USB3_GUSB3PIPECTL_LFPSP0Algn                             (0x1UL << 12)
#define USB3_GUSB3PIPECTL_SkipRxDet_Pos                          13
#define USB3_GUSB3PIPECTL_SkipRxDet_Msk                          (0x1UL << 13)
#define USB3_GUSB3PIPECTL_SkipRxDet                              (0x1UL << 13)
#define USB3_GUSB3PIPECTL_AbortRxDetInU2_Pos                     14
#define USB3_GUSB3PIPECTL_AbortRxDetInU2_Msk                     (0x1UL << 14)
#define USB3_GUSB3PIPECTL_AbortRxDetInU2                         (0x1UL << 14)
#define USB3_GUSB3PIPECTL_DATWIDTH_Pos                           15
#define USB3_GUSB3PIPECTL_DATWIDTH_Msk                           (0x3UL << 15)
#define USB3_GUSB3PIPECTL_DATWIDTH                               (0x3UL << 15)
#define USB3_GUSB3PIPECTL_SUSPENDENABLE_Pos                      17
#define USB3_GUSB3PIPECTL_SUSPENDENABLE_Msk                      (0x1UL << 17)
#define USB3_GUSB3PIPECTL_SUSPENDENABLE                          (0x1UL << 17)
#define USB3_GUSB3PIPECTL_DELAYP1TRANS_Pos                       18
#define USB3_GUSB3PIPECTL_DELAYP1TRANS_Msk                       (0x1UL << 18)
#define USB3_GUSB3PIPECTL_DELAYP1TRANS                           (0x1UL << 18)
#define USB3_GUSB3PIPECTL_DelayP1P2P3_Pos                        19
#define USB3_GUSB3PIPECTL_DelayP1P2P3_Msk                        (0x7UL << 19)
#define USB3_GUSB3PIPECTL_DelayP1P2P3                            (0x7UL << 19)
#define USB3_GUSB3PIPECTL_DisRxDetU3RxDet_Pos                    22
#define USB3_GUSB3PIPECTL_DisRxDetU3RxDet_Msk                    (0x1UL << 22)
#define USB3_GUSB3PIPECTL_DisRxDetU3RxDet                        (0x1UL << 22)
#define USB3_GUSB3PIPECTL_StartRxDetU3RxDet_Pos                  23
#define USB3_GUSB3PIPECTL_StartRxDetU3RxDet_Msk                  (0x1UL << 23)
#define USB3_GUSB3PIPECTL_StartRxDetU3RxDet                      (0x1UL << 23)
#define USB3_GUSB3PIPECTL_request_p1p2p3_Pos                     24
#define USB3_GUSB3PIPECTL_request_p1p2p3_Msk                     (0x1UL << 24)
#define USB3_GUSB3PIPECTL_request_p1p2p3                         (0x1UL << 24)
#define USB3_GUSB3PIPECTL_u1u2exitfail_to_recov_Pos              25
#define USB3_GUSB3PIPECTL_u1u2exitfail_to_recov_Msk              (0x1UL << 25)
#define USB3_GUSB3PIPECTL_u1u2exitfail_to_recov                  (0x1UL << 25)
#define USB3_GUSB3PIPECTL_ping_enhancement_en_Pos                26
#define USB3_GUSB3PIPECTL_ping_enhancement_en_Msk                (0x1UL << 26)
#define USB3_GUSB3PIPECTL_ping_enhancement_en                    (0x1UL << 26)
#define USB3_GUSB3PIPECTL_Ux_exit_in_Px_Pos                      27
#define USB3_GUSB3PIPECTL_Ux_exit_in_Px_Msk                      (0x1UL << 27)
#define USB3_GUSB3PIPECTL_Ux_exit_in_Px                          (0x1UL << 27)
#define USB3_GUSB3PIPECTL_DisRxDetP3_Pos                         28
#define USB3_GUSB3PIPECTL_DisRxDetP3_Msk                         (0x1UL << 28)
#define USB3_GUSB3PIPECTL_DisRxDetP3                             (0x1UL << 28)
#define USB3_GUSB3PIPECTL_U2P3ok_Pos                             29
#define USB3_GUSB3PIPECTL_U2P3ok_Msk                             (0x1UL << 29)
#define USB3_GUSB3PIPECTL_U2P3ok                                 (0x1UL << 29)
#define USB3_GUSB3PIPECTL_HstPrtCmpl_Pos                         30
#define USB3_GUSB3PIPECTL_HstPrtCmpl_Msk                         (0x1UL << 30)
#define USB3_GUSB3PIPECTL_HstPrtCmpl                             (0x1UL << 30)
#define USB3_GUSB3PIPECTL_PHYSoftRst_Pos                         31
#define USB3_GUSB3PIPECTL_PHYSoftRst_Msk                         (0x1UL << 31)
#define USB3_GUSB3PIPECTL_PHYSoftRst                             (0x1UL << 31)

