STMicroelectronics/STM32PRGFW-UTIL/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp257cxx_ca35.h
/* Bit fields for USB3_DGCMD register */
#define USB3_DGCMD_CMDTYP_Pos                0
#define USB3_DGCMD_CMDTYP_Msk                (0xffUL << 0)
#define USB3_DGCMD_CMDTYP                    (0xffUL << 0)
#define USB3_DGCMD_CMDIOC_Pos                8
#define USB3_DGCMD_CMDIOC_Msk                (0x1UL << 8)
#define USB3_DGCMD_CMDIOC                    (0x1UL << 8)
#define USB3_DGCMD_CMDACT_Pos                10
#define USB3_DGCMD_CMDACT_Msk                (0x1UL << 10)
#define USB3_DGCMD_CMDACT                    (0x1UL << 10)
#define USB3_DGCMD_CMDSTATUS_Pos             12
#define USB3_DGCMD_CMDSTATUS_Msk             (0xfUL << 12)
#define USB3_DGCMD_CMDSTATUS                 (0xfUL << 12)

/* Bit fields for USB3_DALEPENA register */
#define USB3_DALEPENA_USBACTEP_Pos           0
#define USB3_DALEPENA_USBACTEP_Msk           (0xFFFFFFFFUL << 0)
#define USB3_DALEPENA_USBACTEP               (0xFFFFFFFFUL << 0)

/* Bit fields for USB3_Rsvd register */

/* Bit fields for USB3_DEPCMDPAR2 register */
#define USB3_DEPCMDPAR2_PARAMETER_Pos        0
#define USB3_DEPCMDPAR2_PARAMETER_Msk        (0xFFFFFFFFUL << 0)
#define USB3_DEPCMDPAR2_PARAMETER            (0xFFFFFFFFUL << 0)

/* Bit fields for USB3_DEPCMDPAR1 register */
#define USB3_DEPCMDPAR1_PARAMETER_Pos        0
#define USB3_DEPCMDPAR1_PARAMETER_Msk        (0xFFFFFFFFUL << 0)
#define USB3_DEPCMDPAR1_PARAMETER            (0xFFFFFFFFUL << 0)

/* Bit fields for USB3_DEPCMDPAR0 register */
#define USB3_DEPCMDPAR0_PARAMETER_Pos        0
#define USB3_DEPCMDPAR0_PARAMETER_Msk        (0xFFFFFFFFUL << 0)
#define USB3_DEPCMDPAR0_PARAMETER            (0xFFFFFFFFUL << 0)

/* Bit fields for USB3_DEPCMD register */
#define USB3_DEPCMD_CMDTYP_Pos               0
#define USB3_DEPCMD_CMDTYP_Msk               (0xfUL << 0)
#define USB3_DEPCMD_CMDTYP                   (0xfUL << 0)
#define USB3_DEPCMD_CMDIOC_Pos               8
#define USB3_DEPCMD_CMDIOC_Msk               (0x1UL << 8)
#define USB3_DEPCMD_CMDIOC                   (0x1UL << 8)
#define USB3_DEPCMD_CMDACT_Pos               10
#define USB3_DEPCMD_CMDACT_Msk               (0x1UL << 10)
#define USB3_DEPCMD_CMDACT                   (0x1UL << 10)
#define USB3_DEPCMD_HIPRI_FORCERM_Pos        11
#define USB3_DEPCMD_HIPRI_FORCERM_Msk        (0x1UL << 11)
#define USB3_DEPCMD_HIPRI_FORCERM            (0x1UL << 11)
#define USB3_DEPCMD_CMDSTATUS_Pos            12
#define USB3_DEPCMD_CMDSTATUS_Msk            (0xfUL << 12)
#define USB3_DEPCMD_CMDSTATUS                (0xfUL << 12)
#define USB3_DEPCMD_COMMANDPARAM_Pos         16
#define USB3_DEPCMD_COMMANDPARAM_Msk         (0xffffUL << 16)
#define USB3_DEPCMD_COMMANDPARAM             (0xffffUL << 16)

/* Bit fields for USB3_DEV_IMOD register */
#define USB3_DEV_IMOD_DEVICE_IMODI_Pos       0
#define USB3_DEV_IMOD_DEVICE_IMODI_Msk       (0xffffUL << 0)
#define USB3_DEV_IMOD_DEVICE_IMODI           (0xffffUL << 0)
#define USB3_DEV_IMOD_DEVICE_IMODC_Pos       16
#define USB3_DEV_IMOD_DEVICE_IMODC_Msk       (0xffffUL << 16)
#define USB3_DEV_IMOD_DEVICE_IMODC           (0xffffUL << 16)

/* Bit fields for USB3_BCFG register */
#define USB3_BCFG_CHIRP_EN_Pos           0
#define USB3_BCFG_CHIRP_EN_Msk           (0x1UL << 0)
#define USB3_BCFG_CHIRP_EN               (0x1UL << 0)
#define USB3_BCFG_IDDIG_SEL_Pos          1
#define USB3_BCFG_IDDIG_SEL_Msk          (0x1UL << 1)
#define USB3_BCFG_IDDIG_SEL              (0x1UL << 1)

/* Bit fields for USB3_BCEVT register */
#define USB3_BCEVT_MultValIdBc_Pos       0
#define USB3_BCEVT_MultValIdBc_Msk       (0x1fUL << 0)
#define USB3_BCEVT_MultValIdBc           (0x1fUL << 0)
#define USB3_BCEVT_MV_ChngEvnt_Pos       24
#define USB3_BCEVT_MV_ChngEvnt_Msk       (0x1UL << 24)
#define USB3_BCEVT_MV_ChngEvnt           (0x1UL << 24)

/* Bit fields for USB3_BCEVTEN register */
#define USB3_BCEVTEN_MV_ChngEvntEna_Pos  24
#define USB3_BCEVTEN_MV_ChngEvntEna_Msk  (0x1UL << 24)
#define USB3_BCEVTEN_MV_ChngEvntEna      (0x1UL << 24)

/* Bit fields for USB3_CAPLENGTH register */
#define USB3_CAPLENGTH_CAPLENGTH_Pos              0
#define USB3_CAPLENGTH_CAPLENGTH_Msk              (0xffUL << 0)
#define USB3_CAPLENGTH_CAPLENGTH                  (0xffUL << 0)
#define USB3_CAPLENGTH_HCIVERSION_Pos             16
#define USB3_CAPLENGTH_HCIVERSION_Msk             (0xffffUL << 16)
#define USB3_CAPLENGTH_HCIVERSION                 (0xffffUL << 16)

/* Bit fields for USB3_HCSPARAMS1 register */
#define USB3_HCSPARAMS1_MAXSLOTS_Pos              0
#define USB3_HCSPARAMS1_MAXSLOTS_Msk              (0xffUL << 0)
#define USB3_HCSPARAMS1_MAXSLOTS                  (0xffUL << 0)
#define USB3_HCSPARAMS1_MAXINTRS_Pos              8
#define USB3_HCSPARAMS1_MAXINTRS_Msk              (0x7ffUL << 8)
#define USB3_HCSPARAMS1_MAXINTRS                  (0x7ffUL << 8)
#define USB3_HCSPARAMS1_MAXPORTS_Pos              24
#define USB3_HCSPARAMS1_MAXPORTS_Msk              (0xffUL << 24)
#define USB3_HCSPARAMS1_MAXPORTS                  (0xffUL << 24)

/* Bit fields for USB3_HCSPARAMS2 register */
#define USB3_HCSPARAMS2_IST_Pos                   0
#define USB3_HCSPARAMS2_IST_Msk                   (0xfUL << 0)
#define USB3_HCSPARAMS2_IST                       (0xfUL << 0)
#define USB3_HCSPARAMS2_ERSTMAX_Pos               4
#define USB3_HCSPARAMS2_ERSTMAX_Msk               (0xfUL << 4)
#define USB3_HCSPARAMS2_ERSTMAX                   (0xfUL << 4)
#define USB3_HCSPARAMS2_MAXSCRATCHPADBUFS_HI_Pos  21
#define USB3_HCSPARAMS2_MAXSCRATCHPADBUFS_HI_Msk  (0x1fUL << 21)
#define USB3_HCSPARAMS2_MAXSCRATCHPADBUFS_HI      (0x1fUL << 21)
#define USB3_HCSPARAMS2_SPR_Pos                   26
#define USB3_HCSPARAMS2_SPR_Msk                   (0x1UL << 26)
#define USB3_HCSPARAMS2_SPR                       (0x1UL << 26)
#define USB3_HCSPARAMS2_MAXSCRATCHPADBUFS_Pos     27
#define USB3_HCSPARAMS2_MAXSCRATCHPADBUFS_Msk     (0x1fUL << 27)
#define USB3_HCSPARAMS2_MAXSCRATCHPADBUFS         (0x1fUL << 27)

/* Bit fields for USB3_HCSPARAMS3 register */
#define USB3_HCSPARAMS3_U1_DEVICE_EXIT_LAT_Pos    0
#define USB3_HCSPARAMS3_U1_DEVICE_EXIT_LAT_Msk    (0xffUL << 0)
#define USB3_HCSPARAMS3_U1_DEVICE_EXIT_LAT        (0xffUL << 0)
#define USB3_HCSPARAMS3_U2_DEVICE_EXIT_LAT_Pos    16
#define USB3_HCSPARAMS3_U2_DEVICE_EXIT_LAT_Msk    (0xffffUL << 16)
#define USB3_HCSPARAMS3_U2_DEVICE_EXIT_LAT        (0xffffUL << 16)

/* Bit fields for USB3_HCCPARAMS1 register */
#define USB3_HCCPARAMS1_AC64_Pos                  0
#define USB3_HCCPARAMS1_AC64_Msk                  (0x1UL << 0)
#define USB3_HCCPARAMS1_AC64                      (0x1UL << 0)
#define USB3_HCCPARAMS1_BNC_Pos                   1
#define USB3_HCCPARAMS1_BNC_Msk                   (0x1UL << 1)
#define USB3_HCCPARAMS1_BNC                       (0x1UL << 1)
#define USB3_HCCPARAMS1_CSZ_Pos                   2
#define USB3_HCCPARAMS1_CSZ_Msk                   (0x1UL << 2)
#define USB3_HCCPARAMS1_CSZ                       (0x1UL << 2)
#define USB3_HCCPARAMS1_PPC_Pos                   3
#define USB3_HCCPARAMS1_PPC_Msk                   (0x1UL << 3)
#define USB3_HCCPARAMS1_PPC                       (0x1UL << 3)
#define USB3_HCCPARAMS1_PIND_Pos                  4
#define USB3_HCCPARAMS1_PIND_Msk                  (0x1UL << 4)
#define USB3_HCCPARAMS1_PIND                      (0x1UL << 4)
#define USB3_HCCPARAMS1_LHRC_Pos                  5
#define USB3_HCCPARAMS1_LHRC_Msk                  (0x1UL << 5)
#define USB3_HCCPARAMS1_LHRC                      (0x1UL << 5)
#define USB3_HCCPARAMS1_LTC_Pos                   6
#define USB3_HCCPARAMS1_LTC_Msk                   (0x1UL << 6)
#define USB3_HCCPARAMS1_LTC                       (0x1UL << 6)
#define USB3_HCCPARAMS1_NSS_Pos                   7
#define USB3_HCCPARAMS1_NSS_Msk                   (0x1UL << 7)
#define USB3_HCCPARAMS1_NSS                       (0x1UL << 7)
#define USB3_HCCPARAMS1_PAE_Pos                   8
#define USB3_HCCPARAMS1_PAE_Msk                   (0x1UL << 8)
#define USB3_HCCPARAMS1_PAE                       (0x1UL << 8)
#define USB3_HCCPARAMS1_SPC_Pos                   9
#define USB3_HCCPARAMS1_SPC_Msk                   (0x1UL << 9)
#define USB3_HCCPARAMS1_SPC                       (0x1UL << 9)
#define USB3_HCCPARAMS1_SEC_Pos                   10
#define USB3_HCCPARAMS1_SEC_Msk                   (0x1UL << 10)
#define USB3_HCCPARAMS1_SEC                       (0x1UL << 10)
#define USB3_HCCPARAMS1_CFC_Pos                   11
#define USB3_HCCPARAMS1_CFC_Msk                   (0x1UL << 11)
#define USB3_HCCPARAMS1_CFC                       (0x1UL << 11)
#define USB3_HCCPARAMS1_MAXPSASIZE_Pos            12
#define USB3_HCCPARAMS1_MAXPSASIZE_Msk            (0xfUL << 12)
#define USB3_HCCPARAMS1_MAXPSASIZE                (0xfUL << 12)
#define USB3_HCCPARAMS1_XECP_Pos                  16
#define USB3_HCCPARAMS1_XECP_Msk                  (0xffffUL << 16)
#define USB3_HCCPARAMS1_XECP                      (0xffffUL << 16)

