STMicroelectronics/STM32PRGFW-UTIL/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp257cxx_ca35.h
/* Bit fields for USB3_DBOFF register */
#define USB3_DBOFF_DOORBELL_ARRAY_OFFSET_Pos      2
#define USB3_DBOFF_DOORBELL_ARRAY_OFFSET_Msk      (0x3fffffffUL << 2)
#define USB3_DBOFF_DOORBELL_ARRAY_OFFSET          (0x3fffffffUL << 2)

/* Bit fields for USB3_RTSOFF register */
#define USB3_RTSOFF_RUNTIME_REG_SPACE_OFFSET_Pos  5
#define USB3_RTSOFF_RUNTIME_REG_SPACE_OFFSET_Msk  (0x7ffffffUL << 5)
#define USB3_RTSOFF_RUNTIME_REG_SPACE_OFFSET      (0x7ffffffUL << 5)

/* Bit fields for USB3_HCCPARAMS2 register */
#define USB3_HCCPARAMS2_U3C_Pos                   0
#define USB3_HCCPARAMS2_U3C_Msk                   (0x1UL << 0)
#define USB3_HCCPARAMS2_U3C                       (0x1UL << 0)
#define USB3_HCCPARAMS2_CMC_Pos                   1
#define USB3_HCCPARAMS2_CMC_Msk                   (0x1UL << 1)
#define USB3_HCCPARAMS2_CMC                       (0x1UL << 1)
#define USB3_HCCPARAMS2_FSC_Pos                   2
#define USB3_HCCPARAMS2_FSC_Msk                   (0x1UL << 2)
#define USB3_HCCPARAMS2_FSC                       (0x1UL << 2)
#define USB3_HCCPARAMS2_CTC_Pos                   3
#define USB3_HCCPARAMS2_CTC_Msk                   (0x1UL << 3)
#define USB3_HCCPARAMS2_CTC                       (0x1UL << 3)
#define USB3_HCCPARAMS2_LEC_Pos                   4
#define USB3_HCCPARAMS2_LEC_Msk                   (0x1UL << 4)
#define USB3_HCCPARAMS2_LEC                       (0x1UL << 4)
#define USB3_HCCPARAMS2_CIC_Pos                   5
#define USB3_HCCPARAMS2_CIC_Msk                   (0x1UL << 5)
#define USB3_HCCPARAMS2_CIC                       (0x1UL << 5)

/* Bit fields for USB3_USBCMD register */
#define USB3_USBCMD_R_S_Pos                     0
#define USB3_USBCMD_R_S_Msk                     (0x1UL << 0)
#define USB3_USBCMD_R_S                         (0x1UL << 0)
#define USB3_USBCMD_HCRST_Pos                   1
#define USB3_USBCMD_HCRST_Msk                   (0x1UL << 1)
#define USB3_USBCMD_HCRST                       (0x1UL << 1)
#define USB3_USBCMD_INTE_Pos                    2
#define USB3_USBCMD_INTE_Msk                    (0x1UL << 2)
#define USB3_USBCMD_INTE                        (0x1UL << 2)
#define USB3_USBCMD_HSEE_Pos                    3
#define USB3_USBCMD_HSEE_Msk                    (0x1UL << 3)
#define USB3_USBCMD_HSEE                        (0x1UL << 3)
#define USB3_USBCMD_LHCRST_Pos                  7
#define USB3_USBCMD_LHCRST_Msk                  (0x1UL << 7)
#define USB3_USBCMD_LHCRST                      (0x1UL << 7)
#define USB3_USBCMD_CSS_Pos                     8
#define USB3_USBCMD_CSS_Msk                     (0x1UL << 8)
#define USB3_USBCMD_CSS                         (0x1UL << 8)
#define USB3_USBCMD_CRS_Pos                     9
#define USB3_USBCMD_CRS_Msk                     (0x1UL << 9)
#define USB3_USBCMD_CRS                         (0x1UL << 9)
#define USB3_USBCMD_EWE_Pos                     10
#define USB3_USBCMD_EWE_Msk                     (0x1UL << 10)
#define USB3_USBCMD_EWE                         (0x1UL << 10)
#define USB3_USBCMD_EU3S_Pos                    11
#define USB3_USBCMD_EU3S_Msk                    (0x1UL << 11)
#define USB3_USBCMD_EU3S                        (0x1UL << 11)
#define USB3_USBCMD_CME_Pos                     13
#define USB3_USBCMD_CME_Msk                     (0x1UL << 13)
#define USB3_USBCMD_CME                         (0x1UL << 13)

/* Bit fields for USB3_USBSTS register */
#define USB3_USBSTS_HCH_Pos                     0
#define USB3_USBSTS_HCH_Msk                     (0x1UL << 0)
#define USB3_USBSTS_HCH                         (0x1UL << 0)
#define USB3_USBSTS_HSE_Pos                     2
#define USB3_USBSTS_HSE_Msk                     (0x1UL << 2)
#define USB3_USBSTS_HSE                         (0x1UL << 2)
#define USB3_USBSTS_EINT_Pos                    3
#define USB3_USBSTS_EINT_Msk                    (0x1UL << 3)
#define USB3_USBSTS_EINT                        (0x1UL << 3)
#define USB3_USBSTS_PCD_Pos                     4
#define USB3_USBSTS_PCD_Msk                     (0x1UL << 4)
#define USB3_USBSTS_PCD                         (0x1UL << 4)
#define USB3_USBSTS_SSS_Pos                     8
#define USB3_USBSTS_SSS_Msk                     (0x1UL << 8)
#define USB3_USBSTS_SSS                         (0x1UL << 8)
#define USB3_USBSTS_RSS_Pos                     9
#define USB3_USBSTS_RSS_Msk                     (0x1UL << 9)
#define USB3_USBSTS_RSS                         (0x1UL << 9)
#define USB3_USBSTS_SRE_Pos                     10
#define USB3_USBSTS_SRE_Msk                     (0x1UL << 10)
#define USB3_USBSTS_SRE                         (0x1UL << 10)
#define USB3_USBSTS_CNR_Pos                     11
#define USB3_USBSTS_CNR_Msk                     (0x1UL << 11)
#define USB3_USBSTS_CNR                         (0x1UL << 11)
#define USB3_USBSTS_HCE_Pos                     12
#define USB3_USBSTS_HCE_Msk                     (0x1UL << 12)
#define USB3_USBSTS_HCE                         (0x1UL << 12)

/* Bit fields for USB3_PAGESIZE register */
#define USB3_PAGESIZE_PAGE_SIZE_Pos             0
#define USB3_PAGESIZE_PAGE_SIZE_Msk             (0xffffUL << 0)
#define USB3_PAGESIZE_PAGE_SIZE                 (0xffffUL << 0)

/* Bit fields for USB3_DNCTRL register */
#define USB3_DNCTRL_N0_N15_Pos                  0
#define USB3_DNCTRL_N0_N15_Msk                  (0xffffUL << 0)
#define USB3_DNCTRL_N0_N15                      (0xffffUL << 0)

/* Bit fields for USB3_CRCR_LO register */
#define USB3_CRCR_LO_RCS_Pos                    0
#define USB3_CRCR_LO_RCS_Msk                    (0x1UL << 0)
#define USB3_CRCR_LO_RCS                        (0x1UL << 0)
#define USB3_CRCR_LO_CS_Pos                     1
#define USB3_CRCR_LO_CS_Msk                     (0x1UL << 1)
#define USB3_CRCR_LO_CS                         (0x1UL << 1)
#define USB3_CRCR_LO_CA_Pos                     2
#define USB3_CRCR_LO_CA_Msk                     (0x1UL << 2)
#define USB3_CRCR_LO_CA                         (0x1UL << 2)
#define USB3_CRCR_LO_CRR_Pos                    3
#define USB3_CRCR_LO_CRR_Msk                    (0x1UL << 3)
#define USB3_CRCR_LO_CRR                        (0x1UL << 3)
#define USB3_CRCR_LO_CMD_RING_PNTR_Pos          6
#define USB3_CRCR_LO_CMD_RING_PNTR_Msk          (0x3ffffffUL << 6)
#define USB3_CRCR_LO_CMD_RING_PNTR              (0x3ffffffUL << 6)

/* Bit fields for USB3_CRCR_HI register */
#define USB3_CRCR_HI_CMD_RING_PNTR_Pos          0
#define USB3_CRCR_HI_CMD_RING_PNTR_Msk          (0xFFFFFFFFUL << 0)
#define USB3_CRCR_HI_CMD_RING_PNTR              (0xFFFFFFFFUL << 0)

/* Bit fields for USB3_DCBAAP_LO register */
#define USB3_DCBAAP_LO_DEVICE_CONTEXT_BAAP_Pos  6
#define USB3_DCBAAP_LO_DEVICE_CONTEXT_BAAP_Msk  (0x3ffffffUL << 6)
#define USB3_DCBAAP_LO_DEVICE_CONTEXT_BAAP      (0x3ffffffUL << 6)

