STMicroelectronics/STM32PRGFW-UTIL/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp257cxx_ca35.h
/* Bit fields for USB3_DCBAAP_HI register */
#define USB3_DCBAAP_HI_DEVICE_CONTEXT_BAAP_Pos  0
#define USB3_DCBAAP_HI_DEVICE_CONTEXT_BAAP_Msk  (0xFFFFFFFFUL << 0)
#define USB3_DCBAAP_HI_DEVICE_CONTEXT_BAAP      (0xFFFFFFFFUL << 0)

/* Bit fields for USB3_CONFIG register */
#define USB3_CONFIG_MAXSLOTSEN_Pos              0
#define USB3_CONFIG_MAXSLOTSEN_Msk              (0xffUL << 0)
#define USB3_CONFIG_MAXSLOTSEN                  (0xffUL << 0)
#define USB3_CONFIG_U3E_Pos                     8
#define USB3_CONFIG_U3E_Msk                     (0x1UL << 8)
#define USB3_CONFIG_U3E                         (0x1UL << 8)
#define USB3_CONFIG_CIE_Pos                     9
#define USB3_CONFIG_CIE_Msk                     (0x1UL << 9)
#define USB3_CONFIG_CIE                         (0x1UL << 9)

/* Bit fields for USB3_PORTSC_20 register */
#define USB3_PORTSC_20_CCS_Pos               0
#define USB3_PORTSC_20_CCS_Msk               (0x1UL << 0)
#define USB3_PORTSC_20_CCS                   (0x1UL << 0)
#define USB3_PORTSC_20_PED_Pos               1
#define USB3_PORTSC_20_PED_Msk               (0x1UL << 1)
#define USB3_PORTSC_20_PED                   (0x1UL << 1)
#define USB3_PORTSC_20_OCA_Pos               3
#define USB3_PORTSC_20_OCA_Msk               (0x1UL << 3)
#define USB3_PORTSC_20_OCA                   (0x1UL << 3)
#define USB3_PORTSC_20_PR_Pos                4
#define USB3_PORTSC_20_PR_Msk                (0x1UL << 4)
#define USB3_PORTSC_20_PR                    (0x1UL << 4)
#define USB3_PORTSC_20_PLS_Pos               5
#define USB3_PORTSC_20_PLS_Msk               (0xfUL << 5)
#define USB3_PORTSC_20_PLS                   (0xfUL << 5)
#define USB3_PORTSC_20_PP_Pos                9
#define USB3_PORTSC_20_PP_Msk                (0x1UL << 9)
#define USB3_PORTSC_20_PP                    (0x1UL << 9)
#define USB3_PORTSC_20_PORTSPEED_Pos         10
#define USB3_PORTSC_20_PORTSPEED_Msk         (0xfUL << 10)
#define USB3_PORTSC_20_PORTSPEED             (0xfUL << 10)
#define USB3_PORTSC_20_PIC_Pos               14
#define USB3_PORTSC_20_PIC_Msk               (0x3UL << 14)
#define USB3_PORTSC_20_PIC                   (0x3UL << 14)
#define USB3_PORTSC_20_LWS_Pos               16
#define USB3_PORTSC_20_LWS_Msk               (0x1UL << 16)
#define USB3_PORTSC_20_LWS                   (0x1UL << 16)
#define USB3_PORTSC_20_CSC_Pos               17
#define USB3_PORTSC_20_CSC_Msk               (0x1UL << 17)
#define USB3_PORTSC_20_CSC                   (0x1UL << 17)
#define USB3_PORTSC_20_PEC_Pos               18
#define USB3_PORTSC_20_PEC_Msk               (0x1UL << 18)
#define USB3_PORTSC_20_PEC                   (0x1UL << 18)
#define USB3_PORTSC_20_OCC_Pos               20
#define USB3_PORTSC_20_OCC_Msk               (0x1UL << 20)
#define USB3_PORTSC_20_OCC                   (0x1UL << 20)
#define USB3_PORTSC_20_PRC_Pos               21
#define USB3_PORTSC_20_PRC_Msk               (0x1UL << 21)
#define USB3_PORTSC_20_PRC                   (0x1UL << 21)
#define USB3_PORTSC_20_PLC_Pos               22
#define USB3_PORTSC_20_PLC_Msk               (0x1UL << 22)
#define USB3_PORTSC_20_PLC                   (0x1UL << 22)
#define USB3_PORTSC_20_CAS_Pos               24
#define USB3_PORTSC_20_CAS_Msk               (0x1UL << 24)
#define USB3_PORTSC_20_CAS                   (0x1UL << 24)
#define USB3_PORTSC_20_WCE_Pos               25
#define USB3_PORTSC_20_WCE_Msk               (0x1UL << 25)
#define USB3_PORTSC_20_WCE                   (0x1UL << 25)
#define USB3_PORTSC_20_WDE_Pos               26
#define USB3_PORTSC_20_WDE_Msk               (0x1UL << 26)
#define USB3_PORTSC_20_WDE                   (0x1UL << 26)
#define USB3_PORTSC_20_WOE_Pos               27
#define USB3_PORTSC_20_WOE_Msk               (0x1UL << 27)
#define USB3_PORTSC_20_WOE                   (0x1UL << 27)
#define USB3_PORTSC_20_DR_Pos                30
#define USB3_PORTSC_20_DR_Msk                (0x1UL << 30)
#define USB3_PORTSC_20_DR                    (0x1UL << 30)

/* Bit fields for USB3_PORTPMSC_20 register */
#define USB3_PORTPMSC_20_L1S_Pos             0
#define USB3_PORTPMSC_20_L1S_Msk             (0x7UL << 0)
#define USB3_PORTPMSC_20_L1S                 (0x7UL << 0)
#define USB3_PORTPMSC_20_RWE_Pos             3
#define USB3_PORTPMSC_20_RWE_Msk             (0x1UL << 3)
#define USB3_PORTPMSC_20_RWE                 (0x1UL << 3)
#define USB3_PORTPMSC_20_HIRD_Pos            4
#define USB3_PORTPMSC_20_HIRD_Msk            (0xfUL << 4)
#define USB3_PORTPMSC_20_HIRD                (0xfUL << 4)
#define USB3_PORTPMSC_20_L1DSLOT_Pos         8
#define USB3_PORTPMSC_20_L1DSLOT_Msk         (0xffUL << 8)
#define USB3_PORTPMSC_20_L1DSLOT             (0xffUL << 8)
#define USB3_PORTPMSC_20_HLE_Pos             16
#define USB3_PORTPMSC_20_HLE_Msk             (0x1UL << 16)
#define USB3_PORTPMSC_20_HLE                 (0x1UL << 16)
#define USB3_PORTPMSC_20_PRTTSTCTRL_Pos      28
#define USB3_PORTPMSC_20_PRTTSTCTRL_Msk      (0xfUL << 28)
#define USB3_PORTPMSC_20_PRTTSTCTRL          (0xfUL << 28)

/* Bit fields for USB3_PORTLI_20 register */

/* Bit fields for USB3_PORTHLPMC_20 register */
#define USB3_PORTHLPMC_20_HIRDM_Pos          0
#define USB3_PORTHLPMC_20_HIRDM_Msk          (0x3UL << 0)
#define USB3_PORTHLPMC_20_HIRDM              (0x3UL << 0)
#define USB3_PORTHLPMC_20_L1_TIMEOUT_Pos     2
#define USB3_PORTHLPMC_20_L1_TIMEOUT_Msk     (0xffUL << 2)
#define USB3_PORTHLPMC_20_L1_TIMEOUT         (0xffUL << 2)
#define USB3_PORTHLPMC_20_HIRDD_Pos          10
#define USB3_PORTHLPMC_20_HIRDD_Msk          (0xfUL << 10)
#define USB3_PORTHLPMC_20_HIRDD              (0xfUL << 10)

/* Bit fields for USB3_PORTSC_30 register */
#define USB3_PORTSC_30_CCS_Pos               0
#define USB3_PORTSC_30_CCS_Msk               (0x1UL << 0)
#define USB3_PORTSC_30_CCS                   (0x1UL << 0)
#define USB3_PORTSC_30_PED_Pos               1
#define USB3_PORTSC_30_PED_Msk               (0x1UL << 1)
#define USB3_PORTSC_30_PED                   (0x1UL << 1)
#define USB3_PORTSC_30_OCA_Pos               3
#define USB3_PORTSC_30_OCA_Msk               (0x1UL << 3)
#define USB3_PORTSC_30_OCA                   (0x1UL << 3)
#define USB3_PORTSC_30_PR_Pos                4
#define USB3_PORTSC_30_PR_Msk                (0x1UL << 4)
#define USB3_PORTSC_30_PR                    (0x1UL << 4)
#define USB3_PORTSC_30_PLS_Pos               5
#define USB3_PORTSC_30_PLS_Msk               (0xfUL << 5)
#define USB3_PORTSC_30_PLS                   (0xfUL << 5)
#define USB3_PORTSC_30_PP_Pos                9
#define USB3_PORTSC_30_PP_Msk                (0x1UL << 9)
#define USB3_PORTSC_30_PP                    (0x1UL << 9)
#define USB3_PORTSC_30_PORTSPEED_Pos         10
#define USB3_PORTSC_30_PORTSPEED_Msk         (0xfUL << 10)
#define USB3_PORTSC_30_PORTSPEED             (0xfUL << 10)
#define USB3_PORTSC_30_PIC_Pos               14
#define USB3_PORTSC_30_PIC_Msk               (0x3UL << 14)
#define USB3_PORTSC_30_PIC                   (0x3UL << 14)
#define USB3_PORTSC_30_LWS_Pos               16
#define USB3_PORTSC_30_LWS_Msk               (0x1UL << 16)
#define USB3_PORTSC_30_LWS                   (0x1UL << 16)
#define USB3_PORTSC_30_CSC_Pos               17
#define USB3_PORTSC_30_CSC_Msk               (0x1UL << 17)
#define USB3_PORTSC_30_CSC                   (0x1UL << 17)
#define USB3_PORTSC_30_PEC_Pos               18
#define USB3_PORTSC_30_PEC_Msk               (0x1UL << 18)
#define USB3_PORTSC_30_PEC                   (0x1UL << 18)
#define USB3_PORTSC_30_WRC_Pos               19
#define USB3_PORTSC_30_WRC_Msk               (0x1UL << 19)
#define USB3_PORTSC_30_WRC                   (0x1UL << 19)
#define USB3_PORTSC_30_OCC_Pos               20
#define USB3_PORTSC_30_OCC_Msk               (0x1UL << 20)
#define USB3_PORTSC_30_OCC                   (0x1UL << 20)
#define USB3_PORTSC_30_PRC_Pos               21
#define USB3_PORTSC_30_PRC_Msk               (0x1UL << 21)
#define USB3_PORTSC_30_PRC                   (0x1UL << 21)
#define USB3_PORTSC_30_PLC_Pos               22
#define USB3_PORTSC_30_PLC_Msk               (0x1UL << 22)
#define USB3_PORTSC_30_PLC                   (0x1UL << 22)
#define USB3_PORTSC_30_CEC_Pos               23
#define USB3_PORTSC_30_CEC_Msk               (0x1UL << 23)
#define USB3_PORTSC_30_CEC                   (0x1UL << 23)
#define USB3_PORTSC_30_CAS_Pos               24
#define USB3_PORTSC_30_CAS_Msk               (0x1UL << 24)
#define USB3_PORTSC_30_CAS                   (0x1UL << 24)
#define USB3_PORTSC_30_WCE_Pos               25
#define USB3_PORTSC_30_WCE_Msk               (0x1UL << 25)
#define USB3_PORTSC_30_WCE                   (0x1UL << 25)
#define USB3_PORTSC_30_WDE_Pos               26
#define USB3_PORTSC_30_WDE_Msk               (0x1UL << 26)
#define USB3_PORTSC_30_WDE                   (0x1UL << 26)
#define USB3_PORTSC_30_WOE_Pos               27
#define USB3_PORTSC_30_WOE_Msk               (0x1UL << 27)
#define USB3_PORTSC_30_WOE                   (0x1UL << 27)
#define USB3_PORTSC_30_DR_Pos                30
#define USB3_PORTSC_30_DR_Msk                (0x1UL << 30)
#define USB3_PORTSC_30_DR                    (0x1UL << 30)
#define USB3_PORTSC_30_WPR_Pos               31
#define USB3_PORTSC_30_WPR_Msk               (0x1UL << 31)
#define USB3_PORTSC_30_WPR                   (0x1UL << 31)

/* Bit fields for USB3_PORTPMSC_30 register */
#define USB3_PORTPMSC_30_U1_TIMEOUT_Pos      0
#define USB3_PORTPMSC_30_U1_TIMEOUT_Msk      (0xffUL << 0)
#define USB3_PORTPMSC_30_U1_TIMEOUT          (0xffUL << 0)
#define USB3_PORTPMSC_30_U2_TIMEOUT_Pos      8
#define USB3_PORTPMSC_30_U2_TIMEOUT_Msk      (0xffUL << 8)
#define USB3_PORTPMSC_30_U2_TIMEOUT          (0xffUL << 8)
#define USB3_PORTPMSC_30_FLA_Pos             16
#define USB3_PORTPMSC_30_FLA_Msk             (0x1UL << 16)
#define USB3_PORTPMSC_30_FLA                 (0x1UL << 16)

/* Bit fields for USB3_PORTLI_30 register */
#define USB3_PORTLI_30_LINK_ERROR_COUNT_Pos  0
#define USB3_PORTLI_30_LINK_ERROR_COUNT_Msk  (0xffffUL << 0)
#define USB3_PORTLI_30_LINK_ERROR_COUNT      (0xffffUL << 0)

