STMicroelectronics/STM32PRGFW-UTIL/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp257cxx_ca35.h
/* Bit fields for USB3_PORTHLPMC_30 register */

/* Bit fields for USB3_MFINDEX register */
#define USB3_MFINDEX_MICROFRAME_INDEX_Pos  0
#define USB3_MFINDEX_MICROFRAME_INDEX_Msk  (0x3fffUL << 0)
#define USB3_MFINDEX_MICROFRAME_INDEX      (0x3fffUL << 0)

/* Bit fields for USB3_RsvdZ register */

/* Bit fields for USB3_IMAN register */
#define USB3_IMAN_IP_Pos                  0
#define USB3_IMAN_IP_Msk                  (0x1UL << 0)
#define USB3_IMAN_IP                      (0x1UL << 0)
#define USB3_IMAN_IE_Pos                  1
#define USB3_IMAN_IE_Msk                  (0x1UL << 1)
#define USB3_IMAN_IE                      (0x1UL << 1)

/* Bit fields for USB3_IMOD register */
#define USB3_IMOD_IMODI_Pos               0
#define USB3_IMOD_IMODI_Msk               (0xffffUL << 0)
#define USB3_IMOD_IMODI                   (0xffffUL << 0)
#define USB3_IMOD_IMODC_Pos               16
#define USB3_IMOD_IMODC_Msk               (0xffffUL << 16)
#define USB3_IMOD_IMODC                   (0xffffUL << 16)

/* Bit fields for USB3_ERSTSZ register */
#define USB3_ERSTSZ_ERS_TABLE_SIZE_Pos    0
#define USB3_ERSTSZ_ERS_TABLE_SIZE_Msk    (0xffffUL << 0)
#define USB3_ERSTSZ_ERS_TABLE_SIZE        (0xffffUL << 0)

/* Bit fields for USB3_RsvdP register */

/* Bit fields for USB3_ERSTBA_LO register */
#define USB3_ERSTBA_LO_ERS_TABLE_BAR_Pos  6
#define USB3_ERSTBA_LO_ERS_TABLE_BAR_Msk  (0x3ffffffUL << 6)
#define USB3_ERSTBA_LO_ERS_TABLE_BAR      (0x3ffffffUL << 6)

/* Bit fields for USB3_ERSTBA_HI register */
#define USB3_ERSTBA_HI_ERS_TABLE_BAR_Pos  0
#define USB3_ERSTBA_HI_ERS_TABLE_BAR_Msk  (0xFFFFFFFFUL << 0)
#define USB3_ERSTBA_HI_ERS_TABLE_BAR      (0xFFFFFFFFUL << 0)

/* Bit fields for USB3_ERDP_LO register */
#define USB3_ERDP_LO_DESI_Pos             0
#define USB3_ERDP_LO_DESI_Msk             (0x7UL << 0)
#define USB3_ERDP_LO_DESI                 (0x7UL << 0)
#define USB3_ERDP_LO_EHB_Pos              3
#define USB3_ERDP_LO_EHB_Msk              (0x1UL << 3)
#define USB3_ERDP_LO_EHB                  (0x1UL << 3)
#define USB3_ERDP_LO_ERD_PNTR_Pos         4
#define USB3_ERDP_LO_ERD_PNTR_Msk         (0xfffffffUL << 4)
#define USB3_ERDP_LO_ERD_PNTR             (0xfffffffUL << 4)

/* Bit fields for USB3_ERDP_HI register */
#define USB3_ERDP_HI_ERD_PNTR_Pos         0
#define USB3_ERDP_HI_ERD_PNTR_Msk         (0xFFFFFFFFUL << 0)
#define USB3_ERDP_HI_ERD_PNTR             (0xFFFFFFFFUL << 0)

/* Bit fields for USB3_DB register */
#define USB3_DB_DB_TARGET_Pos     0
#define USB3_DB_DB_TARGET_Msk     (0xffUL << 0)
#define USB3_DB_DB_TARGET         (0xffUL << 0)
#define USB3_DB_DB_STREAM_ID_Pos  16
#define USB3_DB_DB_STREAM_ID_Msk  (0xffffUL << 16)
#define USB3_DB_DB_STREAM_ID      (0xffffUL << 16)

/* Bit fields for USB3_USBLEGSUP register */
#define USB3_USBLEGSUP_CAPABILITY_ID_Pos            0
#define USB3_USBLEGSUP_CAPABILITY_ID_Msk            (0xffUL << 0)
#define USB3_USBLEGSUP_CAPABILITY_ID                (0xffUL << 0)
#define USB3_USBLEGSUP_NEXT_CAPABILITY_POINTER_Pos  8
#define USB3_USBLEGSUP_NEXT_CAPABILITY_POINTER_Msk  (0xffUL << 8)
#define USB3_USBLEGSUP_NEXT_CAPABILITY_POINTER      (0xffUL << 8)
#define USB3_USBLEGSUP_HC_BIOS_OWNED_Pos            16
#define USB3_USBLEGSUP_HC_BIOS_OWNED_Msk            (0x1UL << 16)
#define USB3_USBLEGSUP_HC_BIOS_OWNED                (0x1UL << 16)
#define USB3_USBLEGSUP_HC_OS_OWNED_Pos              24
#define USB3_USBLEGSUP_HC_OS_OWNED_Msk              (0x1UL << 24)
#define USB3_USBLEGSUP_HC_OS_OWNED                  (0x1UL << 24)

/* Bit fields for USB3_USBLEGCTLSTS register */
#define USB3_USBLEGCTLSTS_USB_SMI_ENABLE_Pos        0
#define USB3_USBLEGCTLSTS_USB_SMI_ENABLE_Msk        (0x1UL << 0)
#define USB3_USBLEGCTLSTS_USB_SMI_ENABLE            (0x1UL << 0)
#define USB3_USBLEGCTLSTS_SMI_ON_HOST_E_Pos         4
#define USB3_USBLEGCTLSTS_SMI_ON_HOST_E_Msk         (0x1UL << 4)
#define USB3_USBLEGCTLSTS_SMI_ON_HOST_E             (0x1UL << 4)
#define USB3_USBLEGCTLSTS_SMI_ON_OS_E_Pos           13
#define USB3_USBLEGCTLSTS_SMI_ON_OS_E_Msk           (0x1UL << 13)
#define USB3_USBLEGCTLSTS_SMI_ON_OS_E               (0x1UL << 13)
#define USB3_USBLEGCTLSTS_SMI_ON_PCI_E_Pos          14
#define USB3_USBLEGCTLSTS_SMI_ON_PCI_E_Msk          (0x1UL << 14)
#define USB3_USBLEGCTLSTS_SMI_ON_PCI_E              (0x1UL << 14)
#define USB3_USBLEGCTLSTS_SMI_ON_BAR_E_Pos          15
#define USB3_USBLEGCTLSTS_SMI_ON_BAR_E_Msk          (0x1UL << 15)
#define USB3_USBLEGCTLSTS_SMI_ON_BAR_E              (0x1UL << 15)
#define USB3_USBLEGCTLSTS_SMI_ON_EVENT_Pos          16
#define USB3_USBLEGCTLSTS_SMI_ON_EVENT_Msk          (0x1UL << 16)
#define USB3_USBLEGCTLSTS_SMI_ON_EVENT              (0x1UL << 16)
#define USB3_USBLEGCTLSTS_SMI_ON_HOST_Pos           20
#define USB3_USBLEGCTLSTS_SMI_ON_HOST_Msk           (0x1UL << 20)
#define USB3_USBLEGCTLSTS_SMI_ON_HOST               (0x1UL << 20)
#define USB3_USBLEGCTLSTS_SMI_ON_OS_Pos             29
#define USB3_USBLEGCTLSTS_SMI_ON_OS_Msk             (0x1UL << 29)
#define USB3_USBLEGCTLSTS_SMI_ON_OS                 (0x1UL << 29)
#define USB3_USBLEGCTLSTS_SMI_ON_PCI_Pos            30
#define USB3_USBLEGCTLSTS_SMI_ON_PCI_Msk            (0x1UL << 30)
#define USB3_USBLEGCTLSTS_SMI_ON_PCI                (0x1UL << 30)
#define USB3_USBLEGCTLSTS_SMI_ON_BAR_Pos            31
#define USB3_USBLEGCTLSTS_SMI_ON_BAR_Msk            (0x1UL << 31)
#define USB3_USBLEGCTLSTS_SMI_ON_BAR                (0x1UL << 31)

/* Bit fields for USB3_SUPTPRT2_DW0 register */
#define USB3_SUPTPRT2_DW0_CAPABILITY_ID_Pos            0
#define USB3_SUPTPRT2_DW0_CAPABILITY_ID_Msk            (0xffUL << 0)
#define USB3_SUPTPRT2_DW0_CAPABILITY_ID                (0xffUL << 0)
#define USB3_SUPTPRT2_DW0_NEXT_CAPABILITY_POINTER_Pos  8
#define USB3_SUPTPRT2_DW0_NEXT_CAPABILITY_POINTER_Msk  (0xffUL << 8)
#define USB3_SUPTPRT2_DW0_NEXT_CAPABILITY_POINTER      (0xffUL << 8)
#define USB3_SUPTPRT2_DW0_MINOR_REVISION_Pos           16
#define USB3_SUPTPRT2_DW0_MINOR_REVISION_Msk           (0xffUL << 16)
#define USB3_SUPTPRT2_DW0_MINOR_REVISION               (0xffUL << 16)
#define USB3_SUPTPRT2_DW0_MAJOR_REVISION_Pos           24
#define USB3_SUPTPRT2_DW0_MAJOR_REVISION_Msk           (0xffUL << 24)
#define USB3_SUPTPRT2_DW0_MAJOR_REVISION               (0xffUL << 24)

