STMicroelectronics/STM32PRGFW-UTIL/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp257cxx_ca35.h
/* Bit fields for USB3_SUPTPRT2_DW1 register */
#define USB3_SUPTPRT2_DW1_NAME_STRING_Pos              0
#define USB3_SUPTPRT2_DW1_NAME_STRING_Msk              (0xFFFFFFFFUL << 0)
#define USB3_SUPTPRT2_DW1_NAME_STRING                  (0xFFFFFFFFUL << 0)

/* Bit fields for USB3_SUPTPRT2_DW2 register */
#define USB3_SUPTPRT2_DW2_COMPATIBLE_PORT_OFFSET_Pos   0
#define USB3_SUPTPRT2_DW2_COMPATIBLE_PORT_OFFSET_Msk   (0xffUL << 0)
#define USB3_SUPTPRT2_DW2_COMPATIBLE_PORT_OFFSET       (0xffUL << 0)
#define USB3_SUPTPRT2_DW2_COMPATIBLE_PORT_COUNT_Pos    8
#define USB3_SUPTPRT2_DW2_COMPATIBLE_PORT_COUNT_Msk    (0xffUL << 8)
#define USB3_SUPTPRT2_DW2_COMPATIBLE_PORT_COUNT        (0xffUL << 8)
#define USB3_SUPTPRT2_DW2_HSO_Pos                      17
#define USB3_SUPTPRT2_DW2_HSO_Msk                      (0x1UL << 17)
#define USB3_SUPTPRT2_DW2_HSO                          (0x1UL << 17)
#define USB3_SUPTPRT2_DW2_IHI_Pos                      18
#define USB3_SUPTPRT2_DW2_IHI_Msk                      (0x1UL << 18)
#define USB3_SUPTPRT2_DW2_IHI                          (0x1UL << 18)
#define USB3_SUPTPRT2_DW2_HLC_Pos                      19
#define USB3_SUPTPRT2_DW2_HLC_Msk                      (0x1UL << 19)
#define USB3_SUPTPRT2_DW2_HLC                          (0x1UL << 19)
#define USB3_SUPTPRT2_DW2_BLC_Pos                      20
#define USB3_SUPTPRT2_DW2_BLC_Msk                      (0x1UL << 20)
#define USB3_SUPTPRT2_DW2_BLC                          (0x1UL << 20)
#define USB3_SUPTPRT2_DW2_MHD_Pos                      25
#define USB3_SUPTPRT2_DW2_MHD_Msk                      (0x7UL << 25)
#define USB3_SUPTPRT2_DW2_MHD                          (0x7UL << 25)
#define USB3_SUPTPRT2_DW2_PSIC_Pos                     28
#define USB3_SUPTPRT2_DW2_PSIC_Msk                     (0xfUL << 28)
#define USB3_SUPTPRT2_DW2_PSIC                         (0xfUL << 28)

/* Bit fields for USB3_SUPTPRT2_DW3 register */
#define USB3_SUPTPRT2_DW3_PROTCL_SLT_TY_Pos            0
#define USB3_SUPTPRT2_DW3_PROTCL_SLT_TY_Msk            (0x1fUL << 0)
#define USB3_SUPTPRT2_DW3_PROTCL_SLT_TY                (0x1fUL << 0)

/* Bit fields for USB3_SUPTPRT3_DW0 register */
#define USB3_SUPTPRT3_DW0_CAPABILITY_ID_Pos            0
#define USB3_SUPTPRT3_DW0_CAPABILITY_ID_Msk            (0xffUL << 0)
#define USB3_SUPTPRT3_DW0_CAPABILITY_ID                (0xffUL << 0)
#define USB3_SUPTPRT3_DW0_NEXT_CAPABILITY_POINTER_Pos  8
#define USB3_SUPTPRT3_DW0_NEXT_CAPABILITY_POINTER_Msk  (0xffUL << 8)
#define USB3_SUPTPRT3_DW0_NEXT_CAPABILITY_POINTER      (0xffUL << 8)
#define USB3_SUPTPRT3_DW0_MINOR_REVISION_Pos           16
#define USB3_SUPTPRT3_DW0_MINOR_REVISION_Msk           (0xffUL << 16)
#define USB3_SUPTPRT3_DW0_MINOR_REVISION               (0xffUL << 16)
#define USB3_SUPTPRT3_DW0_MAJOR_REVISION_Pos           24
#define USB3_SUPTPRT3_DW0_MAJOR_REVISION_Msk           (0xffUL << 24)
#define USB3_SUPTPRT3_DW0_MAJOR_REVISION               (0xffUL << 24)

/* Bit fields for USB3_SUPTPRT3_DW1 register */
#define USB3_SUPTPRT3_DW1_NAME_STRING_Pos              0
#define USB3_SUPTPRT3_DW1_NAME_STRING_Msk              (0xFFFFFFFFUL << 0)
#define USB3_SUPTPRT3_DW1_NAME_STRING                  (0xFFFFFFFFUL << 0)

/* Bit fields for USB3_SUPTPRT3_DW2 register */
#define USB3_SUPTPRT3_DW2_COMPATIBLE_PORT_OFFSET_Pos   0
#define USB3_SUPTPRT3_DW2_COMPATIBLE_PORT_OFFSET_Msk   (0xffUL << 0)
#define USB3_SUPTPRT3_DW2_COMPATIBLE_PORT_OFFSET       (0xffUL << 0)
#define USB3_SUPTPRT3_DW2_COMPATIBLE_PORT_COUNT_Pos    8
#define USB3_SUPTPRT3_DW2_COMPATIBLE_PORT_COUNT_Msk    (0xffUL << 8)
#define USB3_SUPTPRT3_DW2_COMPATIBLE_PORT_COUNT        (0xffUL << 8)
#define USB3_SUPTPRT3_DW2_MHD_Pos                      25
#define USB3_SUPTPRT3_DW2_MHD_Msk                      (0x7UL << 25)
#define USB3_SUPTPRT3_DW2_MHD                          (0x7UL << 25)
#define USB3_SUPTPRT3_DW2_PSIC_Pos                     28
#define USB3_SUPTPRT3_DW2_PSIC_Msk                     (0xfUL << 28)
#define USB3_SUPTPRT3_DW2_PSIC                         (0xfUL << 28)

/* Bit fields for USB3_SUPTPRT3_DW3 register */
#define USB3_SUPTPRT3_DW3_PROTCL_SLT_TY_Pos            0
#define USB3_SUPTPRT3_DW3_PROTCL_SLT_TY_Msk            (0x1fUL << 0)
#define USB3_SUPTPRT3_DW3_PROTCL_SLT_TY                (0x1fUL << 0)

/******************************************************************************/
/*                                                                            */
/*                                 VREFBUF                                    */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for VREFBUF_CSR register  ****************/
#define VREFBUF_CSR_ENVR_Pos    (0U)
#define VREFBUF_CSR_ENVR_Msk    (0x1UL << VREFBUF_CSR_ENVR_Pos)                      /*!< 0x00000001 */
#define VREFBUF_CSR_ENVR        VREFBUF_CSR_ENVR_Msk                                /*!<Voltage reference buffer enable */
#define VREFBUF_CSR_HIZ_Pos     (1U)
#define VREFBUF_CSR_HIZ_Msk     (0x1UL << VREFBUF_CSR_HIZ_Pos)                       /*!< 0x00000002 */
#define VREFBUF_CSR_HIZ         VREFBUF_CSR_HIZ_Msk                                 /*!<High impedance mode             */
#define VREFBUF_CSR_VRS_Pos     (4U)
#define VREFBUF_CSR_VRS_Msk     (0x1UL << VREFBUF_CSR_VRS_Pos)                       /*!< 0x00000004 */
#define VREFBUF_CSR_VRS         VREFBUF_CSR_VRS_Msk                                 /*!<Voltage reference scale         */
#define VREFBUF_CSR_VRS_0       (0x01UL<< VREFBUF_CSR_VRS_Pos)                      /*!< 0x000O0010 */
#define VREFBUF_CSR_VRS_1       (0x02UL<< VREFBUF_CSR_VRS_Pos)                      /*!< 0x00000020 */
#define VREFBUF_CSR_VRS_2       (0x04UL<< VREFBUF_CSR_VRS_Pos)                      /*!< 0x00000030 */
#define VREFBUF_CSR_VRR_Pos     (3U)
#define VREFBUF_CSR_VRR_Msk     (0x1UL << VREFBUF_CSR_VRR_Pos)                       /*!< 0x00000008 */
#define VREFBUF_CSR_VRR         VREFBUF_CSR_VRR_Msk                                 /*!<Voltage reference buffer ready  */

/*******************  Bit definition for VREFBUF_CCR register  ******************/
#define VREFBUF_CCR_TRIM_Pos                (0U)
#define VREFBUF_CCR_TRIM_Msk                (0x3FUL << VREFBUF_CCR_TRIM_Pos)        /*!< 0x0000003F */
#define VREFBUF_CCR_TRIM                    VREFBUF_CCR_TRIM_Msk                    /*!<TRIM[5:0] bits (Trimming code)  */

/******************************************************************************/
/*                                                                            */
/*                           Window Watchdog (WWDG)                           */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for WWDG_CR register  ********************/
#define WWDG_CR_T_Pos           (0U)
#define WWDG_CR_T_Msk           (0x7FU << WWDG_CR_T_Pos)          /*!< 0x0000007F */
#define WWDG_CR_T               WWDG_CR_T_Msk                     /*!< 7-bit counter (MSB to LSB) */
#define WWDG_CR_T_0             (0x1U << WWDG_CR_T_Pos)           /*!< 0x00000001 */
#define WWDG_CR_T_1             (0x2U << WWDG_CR_T_Pos)           /*!< 0x00000002 */
#define WWDG_CR_T_2             (0x4U << WWDG_CR_T_Pos)           /*!< 0x00000004 */
#define WWDG_CR_T_3             (0x8U << WWDG_CR_T_Pos)           /*!< 0x00000008 */
#define WWDG_CR_T_4             (0x10U << WWDG_CR_T_Pos)          /*!< 0x00000010 */
#define WWDG_CR_T_5             (0x20U << WWDG_CR_T_Pos)          /*!< 0x00000020 */
#define WWDG_CR_T_6             (0x40U << WWDG_CR_T_Pos)          /*!< 0x00000040 */
#define WWDG_CR_WDGA_Pos        (7U)
#define WWDG_CR_WDGA_Msk        (0x1U << WWDG_CR_WDGA_Pos)        /*!< 0x00000080 */
#define WWDG_CR_WDGA            WWDG_CR_WDGA_Msk                  /*!< Activation bit */

